{"url": "https://www.reddit.com/r/IndianStockMarket/comments/188chtp/undervalued_or_fair_price_stocks_to_invest_15l/", "post_title": "undervalued_or_fair_price_stocks_to_invest_15l", "post_content": "My family recently redeemed an SGB, which has given us a total of around ₹15L in our bank account. My father wants to invest purely in equity for long term (5+ years), as he has the risk appetite for it.\n\nHe asked me for any suggestions, initially said he wanted to invest full amount in one company like HUL or ITC. I advised to split it at minimum 5L into 3 stocks.\n\nI suggested investing in HDFC, as I feel it seems to be at a good price now. \n\nSBIN also seems to be at a fair value to invest lump sum for long term.\n\nRaymond seems to have fallen quite a lot due to news of owner, but financials and fundamentals seem solid, may be a good time to enter here as well.\n\nDo you guys have any suggestions?\n\nEdit: added point regarding Raymond.", "post_comments": ["\nIf you haven't already, please add your own analysis/opinions to your post to save it from being removed for being a Low Effort post.\n\nPlease DO NOT ask for BUY/SELL advice without sharing your own opinions with reasons first. Such posts will be removed.\n\nPlease also refer to the [FAQ](https://www.reddit.com/r/IndianStockMarket/comments/17bcg2a/frequently asked questions_post_your_common/) where most common questions have already been answered.  \n\nSubscribe to our [weekly newsletter](https://pennyleaks.substack.com/) and join our [Discord group](https://discord.gg/8QF4dqPHuw)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianStockMarket) if you have any questions or concerns.*", "Larsen and toubro / itc / ultratech / maruti suzuki / m&m / aeroflex /  are also some good options", "Instead of 5L in 3, do 3L in 5", "Always remeber a cardinal rule of **investing**: ***\"Never invest your money with shady promoters.\"***  \n\n\nAlso, if your horizon is 5 years with sufficient risk appetite, why not put some money in midcaps? more room for growth, and less riskier than smallcaps.", "I would like to suggest the following stocks : \n\nHDFC Bank\nTitan\nAsian Paints\nVarun Beverages\nIDFC First Bank\nPolycab\nVedant fashions\nSRF\nKPIT Tech\nTata elxsi\nLTI Mindtree", "How many units of SGB? At which price you bought them and which price you redeemed it?", "Rather than investing in stocks if u want to invest in big companies go  with \nNifty bees\nOr nifty junior bees\nAnd nifty mid cap bees", "Check infra/manufacturing sector, it’ll be the new hot thing", "Better choose Mutual funds at this time. 15% compounding every year will give you 100% return in next 5 years. Go safe, and grow. My choice would be HDFC balance advantage fund", "i would not sugeest hul or itc but yes hdfc is a great buy at this price", "Split it into ETF of these 3 indexes. 2 are based on quality and value and one on momentum. Individual stocks positions are only good when you are able to keep an active eye on market. Which means changing stocks as per economy and cycles. For example we all know reliance and hdfc are good business but wouldn’t have made much money if you were holding them for last 2 years.\n\n\nNifty 50 Value 20,\nNifty Alpha low volatility 30,\nNifty 200 momentum 30.\n\nAll 3 have given considerable better risk adjusted returns than Nifty itself.", "diverify the portfolio instead 3 stock. if u can't go multicap Mutual Funds\n\nCurrently PSU stocks are in boom - My suggests are as follows as current level -\n\nPSU OIL - IOC/HPCL/BPCL,\n\nPSU FERTILIZER - RCF/FACT\n\nPSU RAIL - RVNL/IRCTC\n\nPSU DEFENCE - HAL/BEL\n\nTECH - TATATECH/TECHM\n\nPSUBANK- UNIONBANK/BOI\n\nPVT BANK - IDFCFB/AXIS/HDFCBANK\n\nRENEWAL ENERGY - TATAPOWER/KPIGREEN/INOXWIND/ ADANITOTALGAS\n\nNBFC - L&FH/M&MFH/SBFC\n\nJEWELLARY - TITAN\n\nThank me after Election 2024 result", "Reliance icici Tata motors", "IRFC, GRSE, IDFC BANK", "OP, maybe look at some PSU/dividend paying stocks. They should ensure you get a dividend of 1L from your investment.", "Instead of going All in on select stocks, research about some good mutual funds with a long history of return ( not the ones that came up in the last two three years with 35% returns), Parag Parikh flexi cap or axis growth opportunity looks good to me. You can always park your 1/3 in some small cap mutual fund with 7+ year of horizon. \n\nDisclaimer : I'm not an expert and this is not financial advice, just my two cents. Do your own research 🙂", "Natco pharma, ITC, dr reddy are priced low. But are great companies.", "Do STP, don't invest in one Go, pick 10 good business for long term\nMy pick\n\n1. Brittania\n2. HDFC Bank\n3. Motherson sumi\n4. Reliance\n5. ICICI Bank\n6. TITAN \n7. TCS\n8. DMART\n9. ANy small cap ETF\n10. nifty 50 ETF\n\nDo doller cost averaging/SIP in it.", "If you have moderate to high risk appetite go for PSUS and Central Government stocks they are booming rn", "What's an SGB?", "Ems limited\n\nSouth Indian bank\n\nKarnataka bank\nGIPCL\n\nFEDERAL BANK\n\nPNB", "3 stocks are still very very risky. Include mutual funds too, I would suggest", "One stock to change your entire portfolio: Tata Motors 📈💥💰period.", "I was watching Raymond today. Was 1501 at 11am and jumped to 1550 around 12. Ended the day even higher. \n\nI still think the stock might come down when profit booking happens. What do you guys suggest, a good buy?", "Would suggest you to look into small cap or mid cap stock which can become large stock if your view is long term with right stocks you will definitely get good returns", "[deleted]", "HDFC Bank is good option\nI would suggest excide industries ( it's gonna sky rocket in 5 years)\nThe third one has multiple but u can choose either of them( IREDA, RVNL,IRFC, Paras defence)", "Put in HDFC Flexi Cap fund, that has give almost 16% return for last 20 years", "NCC Ltd", "HDFC Bank, L&T and Marico", "Don't invest in banks", "Hindustan Unilever, m&m and itc and reliance", "63 moon tech. get it and forget buddy.", "Niftybees, mid150, goldbees.", "Nestle India. 10% down from peak (Covid correction itself was only 15%). Solid and trustworthy. Yes correction was due to stock split but still stand by this. ", "Thanks, will research them and select", "That's a fair point, might try to start researching midcaps.\n\nAny stocks you have been researching? Feel free to share", "Coffee can portfolio? I second these stocks, would also add Page Industries to this.", "Can't say exactly, but I can give you the rough calculation. We got around 100% return in 7 years, dad had invested around 6-7L with the option of holding till 5 years to max of 8 years. We took it out at year 7, receiving total (including yearly 2.5% interest) of 15L", "Any particular reason you wouldn't suggest those FMCG giants? I feel like they have still have potential for growth especially itc", "!Remind Me 1 year", "Rs. 1L dividend from an investment of Rs. 15L, how is that possible ?", "Meaning of dollar cost averaging?", "Yeah I agree, that's why I think sbi is a good buy. As for others, not sure if it is right time to enter REC, PFC, etc.\n\nAny suggestions?", "> SGB\n\nSovereign Gold Bond", "Profit booking?😂", "It’s going down because the promotors of that company are having a bar fight. \n\n\nWait till the dust settles.", "[deleted]", "Why do you say so?", "+1 don't invest in Financials currently.  Try investing smaller sums in growth companies. Not any, but specifically EV tech,autos with EV, solar power, Power stocks, IT and defensive fmcg. IT specifically after new financial year, the bull rally is losing steam, market will go down or sideways till elections, an election rally will come till current ATH thats gonna be made in few days. And then prep for a good correction. Everyone is giving ball talks on market growth and stuff. 2024-25 can be a tumultuous year.", "I am reading peter lynch and one thing he points out that investing in a good company at the wrong time is same as investing in a bad company. So keep this in your mind.\n\n\nI find lumpsum investment hard because it is sensitive to entry.", "Rather put that money in sbi magnum small cap for the next 10 years and add when it’s NAV falls, no use buying high PE stocks", "Yes, based on the principles of coffee can portfolio", "Why page industries?", "Doesn't redeeming them before 8 years makes it taxable?", "well the only fmcg stock i am bullish is godrej consumer... i think itc is given a fair runup and i dont think it is a good buy right now", "I will be messaging you in 1 year on [**2024-12-01 20:08:37 UTC**](http://www.wolframalpha.com/input/?i=2024-12-01%2020:08:37%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/IndianStockMarket/comments/188chtp/undervalued_or_fair_price_stocks_to_invest_15l/kblblsn/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FIndianStockMarket%2Fcomments%2F188chtp%2Fundervalued_or_fair_price_stocks_to_invest_15l%2Fkblblsn%2F%5D%0A%0ARemindMe%21%202024-12-01%2020%3A08%3A37%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20188chtp)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "That would require a dividend return of 6% or more. IOC, Coal India both have given a higher rate of return as dividend in the last 12 months. Check and you’ll find a few more stocks", "Kbhi toh hogi 🥲\nNifty niche aayega kbhi toh", "It's hard to say when the dust will settle with regards to the promoters. I am waiting for Nifty to fall from ath, and then will look to invest.", "[deleted]", "ITc and ultra tech will give flat returns from here on, mark my word", "Can u elaborate?", "Strong fundamentals, excellent relationship with principal (Jockey) additional opportunities with Speedo and sector won't die down. Somehow it is currently in mid cap but I would regard it very solid for long term growth.", "Yes. It becomes taxable gain.", "I believe ITC has a good growth ahead. Most of the folks use ITC products almost daily.", "Bhai raymond itna gira ha due to family fued, aur bhi girr sakta, I'm waiting for  this share to get stable", "who are you", "RemindMe! 1 year", "Is it bcos it crossed 9000? Well with partial ownership on the cards u will se such expensive scrips boom. And if you are talking according to fundamentals then an industry leader tht too in the infra sector in which gov is spending so much looks a bad option to u thn i pray god to provide u with some help🙏🙏. \nItc on the other hand is in talks with taking over the brand fortune from adani wilmar thn wee will see", "Coffee can portfolio is basically identifying good strong companies with high competitive advantage, clean and professional management, and high growth numbers\nAnd then hold those stocks for long, and wait to see the magic of compounding. \n\nThe parameters I use for identifying such companies are  \n\nHigh ROE and ROCE (>15) \nGood consistent topline and bottom line growth\nGood operating margins\nConsistent Positive free cash flows\nClean and professional management\n\nThese are just some general rules, and sometimes vary from sector to sector", "But valuation is beyond sane. I still cant get over the fact that why a kacche baniyan ka business get 83 P/E, when the unorganized sector is huge for this. Even if I assume a 20% growth for the next 2 years, with P/E remaining the same as 83. The fair upside is 45-50%, with EPS being around 737, this is assuming there is no inorganic growth :)", "No after 5 it's not taxable as u can redeem by RBI right?", "If that has not been factored in the market price of ITC shares already, how much more time will it take?", "It jumped up 60 points after 7 straight days of falling. Tho I am sitting on cash rn and will see how Nifty and Raymond reacts.", "Kacche Baniyan mat bolo Babubhai, innerwear bolo ;)\n\nUnorganised sector is big, yes, but has its own set of problems including availability of capital, labour issues etc. My reasons for recommendation is potential of growth where you can look at this brand at affordable luxury, which will be \"attainable\" for people coming into money. Granted, innerwear won't be the first thing they spend on. P/E is high, I will agree with you there. \n\nI think it is time they split the stock. Lot of folks won't buy it just looking at the cost of the share. Someone who wants to invest less than their share price cannot due to inordinate high level of stock price.", "After 5 years of lockin till maturity, if you redeem/trade it then it will have LTCG. If you hold till maturity, completely tax free.", ">how much more time will it take?  \n>  \n>I am not sure, ITC started its run last year, and now it is consolidating after the run.  440 is the new 200 zone,  \nsoon it will be break out to new highs. look at the fii holding."]}