{"url": "https://www.reddit.com/r/stocks/comments/1bbz700/rstocks_daily_discussion_monday_mar_11_2024/", "post_title": "rstocks_daily_discussion_monday_mar_11_2024", "post_content": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.", "post_comments": ["Boeing door blowout now is the subject of DOJ *criminal* investigation.  Criminal investigation into your company is bearish, right?  \n\nAnd isn't Boeing on some kind of don't-break-any-more-laws probation as part of the special deal that kept their personnel from going to prison over the deaths they cause with MAX-9?", "Finally rotating into goog. 🥲", "Wow! The best and worst performing stocks YTD in the entire S&P 500 are both Mag 7 stocks: NVDA and TSLA, respectively! [Check for yourself here](https://www.slickcharts.com/sp500/performance).\n\nNVDA +76% far and away the winner, with 2nd place going to Constellation Energy's +46%. Last place is TSLA at -29%, with Charter Communications at -27% as second worst. AAPL is -11% (476th place), GOOG -3% (397th place). \n\nI thought the S&P 500 was just being held up by 7 stocks. But 3 are red and one of them deeply so. I guess more accurately, the S&P 500 is just being held up by 4 stocks?", "Finally pulled the trigger and bought some Google today. Kept a bit of dry powder in case US CPI shits the bed tomorrow. I think given the trajectory of earnings growth alone it’s worth more than current PE ratio. Also like stocks that have been dumped based on silly news like a slightly wayward AI. Doesn’t currently affect core business (though I accept it might in years to come). Then outside of that you always have the opportunity for crazy random good news. A new piece of software that’s a surprise hit or some favourable macro trends. Happy with my purchase anyway", "great timing is buying pfe at 28, holding 3 months, then having to sell at 26/share to cover an unexpected very large expense, then the stock rocketing over 28 after.\n\nI was going to go on margin to keep the stock as I expected a rebound sometime this year, and then buy back in 30 days (which would incur a 1% cost with margin around 13%), but decided to make the \"smart\" decision and sell the stock instead.\n\nI bet when I can finally buy back in after wash sale is over the stock is somehow over 30.\n\n/s", "Is there any news on $META ? Dumped ~3% pre market", "I think for me psychologically taking profits is really hard", "How do y'all deal with taking profit, I find it so hard and my portfolio is pretty small, I'm up 100% on AMD and 80% on SMH and I took a small amount from both to rotate into more stable plays but idk if I made the right choice", "It's in CPI Data's hands now", "Jeez what happened with META? Down ~4% this AM", "All eyes on CPI. Oil and Gas may make it hot", "did the market close an hour early?", "Up 1.5K on google. youtube is the single most important internet product imo. happy to buy the dip.\n\nBA is looking tasty right now\n\nSofi leap calls should start to be on everyones mind around these prices, or if sofi goes any lower. It can easily pop to 9.5$ with another earnings beat.", "Last 4 years of CELH revenue growth: 73.96%, 140.41%, 107.97%, 101.65% (TTM).\t\n\nAnalyst revenue growth estimates for 2024 and 2025: 42% and 31%. Implying EPS growth estimates of 44% and 41%. These in turn imply forward P/Es of 80 (on 2024 EPS) then 57 (on 2025).\n\nIn my view this seems very pessimistic of a slowdown for a company that is taking market share from Monster and also acquiring customers new to the energy drink category, only now expanding internationally at scale (Canada, UK, Ireland) thanks to an exclusive distribution deal with Pepsi. \n\nI'm wondering if they don't just get simply bought out. Seems like obvious move is for Pepsi to fully takeover. It's already been an incredibly good investment so far for them, as they invested $550M in August 2022 for instance.\n\n---\n\nI know it isn't going vertical like other stocks, but $SBUX is now at a forward P/E of 22. I'm not buying because I already have a pretty big position but seems like a decent entry point. And holy shit coal is getting slammed today lol.", "Considering shifting some nubank gains over to more meli. I like meli a bit more since it's both more proven over a longer track record and doesn't have the same kind of credit risk nubank possesses. Nubank has been a tank recently though where meli has sold off post earnings", "I've mentioned TPL (Texas Pacific Land) as one of my favorite watchlist companies. Absolutely phenomenal business that owns 800,000 acres of land, debt free, in the Permian Basin. I actually think it's undervalued now primarily because a few years ago Conoco Philips purchased 200,000 acres in the Permian for around $10 billion. TPL has a market cap of around $11 billion and owns 4x that land. Plus innovative ways to grow cash flows, virtually 0 operating costs.....\n\nHowever, the company has had a dispute between management and its shareholders, details [here](https://open.substack.com/pub/specialsituationinvesting/p/tpls-governance-battle?utm_source=share&utm_medium=android&r=23ti9i). There's also a shareholders website with constant updates found [here](https://tpltblog.com/). The shareholder base is incredibly long term focused, and has been rewarded for it. The board of directors has been presumably looking for more short term gains and self enrichment. \n\nI'm August, the shareholders won a lawsuit against the board which gave shareholders increased power. The stock went from $1500 to $1950 in a few weeks. However, I'm December the board won an appeal and will retain their power. The stock went from $1750-$1490 in two days. \n\nI still think this is an amazing company, but I can't bring myself to own it with self sabotaging management at the helm.", "Community thoughts on TSM? Any other semiconductors I should look at for long term?", "My WBD bags feeling a little lighter", "I hope me selling my nvda on friday was the right call lol", "MSTR up pre market.\n\nThe corn up before spot etf open.\n\nI choose rich everytime.", "Does anyone own AXON? I'm interested in buying some shares but not sure about their market size/potential", "Hawkins, Inc. (Nasdaq: HWKN), a leading specialty chemical and ingredients company, has completed the acquisition of Industrial Research Corporation. Industrial Research distributes water treatment chemicals and equipment for its customers in central to northern Louisiana, eastern Texas and southern Arkansas.\n\n“As we continue to execute on our strategy to grow our water treatment business, we believe this tuck-in acquisition fills a geographical void in northern Louisiana and east Texas and will allow us to accelerate our growth in the surrounding regions. Industrial Research has built a strong business that is well-connected with the local community and we intend to maintain those connections. I would like to welcome the Industrial Research team to the Hawkins organization and look forward to our continued growth together,” said Hawkins Chief Executive Officer Patrick H. Hawkins.", "Listened to a podcast epi about SKY HARBOUR GROUP CORPORATION (SKYH). Really interesting and niche market. Happy Monday!", "u/generouscookie1981\n\nI had to double check before I posted, but TPL estimates they have 14 years of oil inventory at $40/barrel. I'm not sure why they use that as a baseline, though WTI has only dropped below that level 3 times (2009, 2016, and 2020) in the last 20 years. If prices are higher than $40, they have more inventory, but it's only viable at those higher price points.\n\nSome additional sources of revenue include grazing rights, renewable energy leases, as well as water rights and potash mines.", "Got confirmed for the Reddit DSP program. Thinking might buy some shares just so I can say I’m an owner of Reddit 😎\n\nIn all seriousness, thinking I’ll buy some shares though. Not sure I’ll HOLD them, but the opportunity to buy in at the institutional IPO price is pretty enticing.", "[BofA data on aftertax consumer incomes/savings](https://i.imgur.com/aFKBKJV.png) by income level.\n\n[Jerome Powell right now](https://i.imgur.com/y3XljZf.png)", "British American Tobacco. out of favor with investors, and there are of course reasons for this.\n\ncigarette volume is going down worldwide, they are not growing overall, debt is a little to high with interest rates up.\n\nstill it has gone too far now. PE around 7, dividend yield almost 10%, and they are very committed to it, still growing it. also they own 29% of India's ITC, and this stake is worth almost 1/3 of their current market cap of 65bn. they want to sell some of that now, and use the money presumably to pay down debt a little, but also start share repurchases.\n\nfor me this looks great now. tobacco consumption probably doesnt go to zero in 20 years, and this is what this stock price is currently anticipating imo.....so i bought some", "Core CPI tomorrow is expected to be 0.3% MoM.\n\nAn improvement over January of 0.4% which will help show that month was a temporary blip and we get a nice downward glide in inflation.\n\nAgain though, worth repeating that if inflation fight ends up a little bumpy, the best way to protect yourself ironically is not to sit on the sidelines praying for mass unemployment.\n\nInstead it is to stay invested and ignore the noise.  There is enormous amounts of data that shows rising prices = rising revenue and rising profits.\n\nIncomes are doing fantastic (much faster than inflation)!  The best way to protect what you save and participate in the upside is being disciplined with equities and keep adding small amounts over time!", "I've mentioned William O'Neil's books on here previously as a great read to learn about how the market works. O'Neil was the founder of Investors Business Daily and the originator of.a technical trading strategy. \n\nI'm not a trader, personally, but traders make money off the mechanics of the market, as opposed to the fundamentals of a company. So if you want to know how and why market movements happen.....learn from traders. \n\nAnyway, one thing O'Neil discusses is blowoff tops to rallies. Where people essentially FOMO into a hot stock driving it higher until it suddenly runs out of buyers. A tell tale sign of this is a series of gap ups on no news and high volume. Look at the NVDA chart ....it's a perfect representation of this. I have no opinion on the stock long term or its valuation. It's in my \"I don't know\" category actually. I see a bear and bull case of it at this valuation. However, that chart looks it's going lower in the short term. $700 wouldn't surprise me, just based on technical support levels.", "Hims with a new 52 week high today, has been strong post earnings", "At what time will the CPI data be published?", "The CPI is honestly feeling more and more like a huge roulette game. Zillow rent and housing price index started going down (in terms of YoY) all the way back in 2022, while CPI shelter inflation has lagged severely, and has contrarily been going up every month, including last. Everyone is pretty much just guessing and placing bets as to when the lag stops.", "Bought the dip on AMD and SMCI.\n\nHope that's not a mistake.", "Google, and AAPL finally bottom.", "The whole market is down as investors anticipate CPI data tmr. If it is above 3.1% expect a market wide selloff of 1.9% and if it is at or below, expect a buy in of something less than 2%", "BofA S&P year end target even more 🐂 ish than me lol (mine was 5250 minimum) but we are rapidly approaching it and I might need to revise it up.  What they are saying:\n\n* \"No sign of bubble\".\n* \"Investor sentiment neutral.\". So not tilting bullish or bearish.\n* \"More like 1995, not like 2000.\"\n* Price target moved up from 5000 to 5400 SPX by EOY 2024.\n* Today's companies deserve higher multiples (I agree, stronger moats).", "China exposure actually helping cushion this ai selloff for me today, funny to see green on a hot inflation print being a good thing as the polar opposite of USA", "I have been looking into RIVN - they just delayed the Georgia plant construction-,\nDo you think they are over leveraged and won’t be able to cross the finish line, or is this a temporary delay and no is the time to get in", "I remember in one of his interviews in 2022 biden said that there will be no recession or if there is one it will be short. When a politician says there is a slight chance of recession it means that he is convinced it is inevitable. \n\n\nThe fact the economy still expanded through 2023 took many people by suprise. Both in Washington and Wallstreet. ", "Meta down almost 6% no news no nothing. Yet nvidia as inflated as it is continues to go up. What's the reason?  \nSomething behind the scenes must have happened, otherwise, I see no reason why a stock like Meta would drop 6% in just 1 day - I don't see almost any other Ai stocks doing that.", "I'm already maxing out my Roth and 401k, had some extra money so I threw in 3k on QQQM today. Set it and forget it, maybe that 3k will buy me a new (modestly priced Toyota or Honda) car 10 years from now.  ", "Seems like AAPL and GOOGL starting to bottom and pretty green vs. market.\n\nHope you quietly loaded up big during the massive firesale.\n\nBoth incredibly undervalued.", "[removed]", "BROS is hanging barely above max profit on my buy-write. 30 strike calls expiring Friday. That looks like it’s going to assign out and lock in about +7.5% over 3 weeks for me. I’m not mad at that ROI. \n\nMS is trading sideways, flat to my basis, as expected through the early part of the year. I’m up about 3% on it via covered calls and dividends since mid January. My current calls expire 3/28, and I’ll leave calls off from end of March to earnings on 4/16. With the market up this much early in the year, their wealth management business AUM will be up, which means they’ve been soaking up increased fees through the quarter. Any increase on the investment banking side would predict strong guidance.", "Lexicon Pharmaceuticals presented some good news. $LXRX", "Are these PENN positions worth sitting on any longer.  I’m down aroune $600 on this and looking to cash out my positions and buy some more QQQ.  I personally think tur espn bet app is crap compared to DK and others.", "What do you guys think about ABDE this week coming up with earnings. Web traffic is up 450million to 500. This quarter. What are your guys’s thoughts?", "[removed]", "*Observation:*\n\n9-day VIX is elevated to levels not seen since the Oct/Nov volatility and shock of 10Y rising so high, before Jay calmed everyone down with pivot signals.\n\nHOWEVER, regular VIX, 3 month VIX, 6 month, etc. are not that high.\n\n*My Conclusion:*\n\nMarket believes tomorrow CPI could potentially produce some super short-term volatility.  However, ultimately market will also digest it and realize it doesn't mean Fed will overreact with something absurd like a hike.\n\nBuy the dip folks, good news is not bad news.", ">Someone says \"I really hate soccer\" and you say \"oh yeah? Well let me tell you all the reasons why soccer is the bomb!\"\n\n>Like, you can't take people's feelings away from them, lol. And the piece wasn't exactly sensationalist or anything - they did a good job explaining what might be behind those feelings, with lots of data points.\n\nu/Mundane-Option5559 brought up an interesting point.  That yes extremely negative feelings about the economy matter.\n\nThat even though real incomes are soaring, or home ownership is actually in an incredibly great place relative to history (it's a myth, boomers didn't have it easier buying a home).  Or one of the greatest campaigns to reduce inequality and increase financial well-being in history have been successfully fought by Biden and Powell.\n\nHowever, people are sour about it.  All I can say is A) sentiment is actually improving slowly.  B) That people will ultimately decide if they prefer objectively worse financial outcomes at the voting booth.  We should still try to convince them of the truth that on average, they are better off on virtually every single metric.\n\nAnd finally C) sentiment is extremely partisan.  If you think Orange Man is cool you are FAR more likely feel \"bad\" about the economy.  Sadly yes, many of them don't like seeing the \"wrong\" people finally succeed after being left behind over and over again.  Historically rug gets pulled from minorities, disabled, and poor right when things are going great for them.\n\nhttps://fred.stlouisfed.org/graph/fredgraph.png?g=1i1K1", "What are y’all’s thoughts on the Reddit ipo?", "Looks like COIN is loving UK opening door for exchange traded products.\n\nAs regulators slowly become comfortable and ETFs are commonplace in all major jurisdictions, $100k or $200k 🌽 maybe is not a meme.\n\nThat's a long way in the future of course and a long process but fun to think about.", "ORCL in After Hours 👀!\n\n>The company’s cloud services and license support segment, its largest business, saw a 12% increase in revenue.", "Another pair of FUD items, #731, #732 crossed off list:\n\n~~BTFP expired without credit markets or any banks blowing up~~.\n\n~~Hard landing, mass layoffs starting in 1Q.~~", "We need some prayer's for tomorrow's CPI data.", "Who is from Europe and invests a lot in Canadian (penny) stocks ?\n\nWhich broker do you use ?", "[deleted]", "u/ap9384629344432\n\nAt what point do you buy more AMR, if any? \n\nI put in a limit order for HCC today, just for a starter position, but I don't think it filled. \n\nAlso, I've made the argument here that time is often the biggest source of mispricing in the market. I believe when we talked valuation of coal companies we mentioned that after 5 years the terminal value is generally $0. However, for met coal, that's not really true. There's not really a substitute for coal in the steel making process at this point. So there should be demand long after 5 years. Consider the value of an AMR or HCC of they generate current level cash flows for 10 years into the future......kinda an interesting mind game.", "I currently use RobinHood and it’s the only app I’ve ever used. It’s alright. Gets the job done. Are there other apps I should look into that are better? I’d like to buy international stock but RobinHood doesn’t really have that option", "Oh great.  Look at who CNBC's Anchor and Sr Disinformation Contributor Joe Kernan is platforming today.", "February 2024\n\nCPI 3.12\n\nCORE CPI 3.70\n\nInflation Nowcasting", "What do you think about this Reddit IPO offering? \n\nOn the surface, I’m concerned. It looks like initial investors attempting to make long time users the new bag holders. I am sure reddit will fundamentally change as it becomes more monetized, and on the upside it does have access to a large population that does not use other social media. However, they have yet to show a profit for their entire existence.", "For such a \"Bullish Market\" it's crazy how devastating news-less red days are.\n\nGood news = green for 1-2 days\n\nNo news/bad news = infinite red for however long it takes for good news to come.", "Wonderful podcast on inflation on Odd Lots:\n\n[What Really Goes Into the Fed's Favorite Measure of Inflation?](https://podcasts.apple.com/us/podcast/what-really-goes-into-the-feds-favorite-measure/id1056200096?i=1000647505440)\n\n* Goes in depth into the differences between CPI and PCE.  \n\n* What's driving recent inflation.\n\n* Why our inflation measures tend to smooth out changes for the sake of being less volatile but also very lagging of real market prices.  Forward measures show **we're already at 2.0%**.  People who complain about inflation are probably complaining about prices from long time ago, not today.\n\n* Seasonality is likely a BIG reason why January was so bad.  It's often the case that end of quarters and even more so end of year lots of adjustments happen.  That doesn't mean it will be persistent.\n\nIf the guests are correct then recent blip is yes, transitory and Powell is correct in his thinking and path:\n\n[Jerome Powell Says Fed on Track to Cut Rates This Year](https://www.wsj.com/economy/central-banking/powell-says-fed-on-track-to-cut-rates-this-year-52e5feb3?mod=hp_lead_pos2)\n\n>\"Fed chair characterizes last year’s inflation slowdown as notable and widespread.\"", "cute lil paypal trying to get it's neck above water (60/share) again. 57th time's the charm?", "Any thought on rising biotech VKTX? Price plunge nearly 30% over last 5 trading days", "Reddit IPO?", "How many brokerage accounts is it good to have? I know that’s a broad question. I currently have RobinHood but have thought about adding fidelity since they may offer more international stocks to buy. Kinda curious what everyone thinks of multiple accounts", "Any other bubbly stocks like NVDA in the market? Completely detached from fundamentals?", "Were the bears right?", "My meta accidentally got sold from limit stop.. any suggestions on what to buy?\nI am thinking either rebuy meta or go with netflix. Feel netflix increasing prices might get more revenue but meta going hard on ai might be good too... or go with vti or any suggestions. \n\nThanks.", "We seem to have hit a peak. Just a little up and then giving it back every couple days.", "And the faults start coming and they don't stop coming...\n\nhttps://www.businessinsider.com/50-injured-after-boeing-787-technical-event-caused-sudden-drop-2024-3", "Incredible coincidence that John Oliver just talked about Boeing in his latest episode, then the very next day the news of a DOJ investigations came to light.", "What hasn't anyone been making this argument for over a year?!", "RSP is still up 5%.  S&P is 7%.\n\nPeople just love to bitch and moan, that's all.\n\nEven if market were held up by a small # of winners.  That's nothing new vs. history.  That's always the case.  \n\nMost stocks suck and are losers.  1% of stocks powered half of wealth creation, 4% create all of it.\n\nThat's why retail needs a healthy does of VOO as a ballast.", "I loaded up on NVDA, I am a huge believer of their RTX 50 series GPUs.", "Sorry for being really nosy but if you don't mind me asking, did this unexpected large expense exceed 6 months of total household salary?\n\nIf so I think it is a good idea to keep at least that in cash.  One of the few times I actually promote cash.", "Trimmed some of my O, PFE, and MO end of December to also make a big purchase. Most of the lots i sold were in the red. Sucky timing but that’s what the money is for I guess", "And up 40% this year. No need to dip a little bit when it’s been soaring", "It seems to trade with the AI stocks and they’re all down today", "Nope, just rotation out of overheated tech stocks.\n\n\nIt's clear this got to dangerous territory already since Apple is not blocking Nvidia dragging the Nasdaq lower.", "Good!  Statistically retail tends to lose the most money selling early.\n\n>“Far more money has been lost by investors preparing for corrections, or trying to anticipate corrections, than has been lost in corrections themselves.” \n\n– *The G.O.A.T. Peter Lynch*", "no one ever got poor by taking profit.  i do it all the time since i prefer trading than long term investing with my brokerage account.  it's more of a hobby", ">How do y'all deal with taking profit,\n\nIf you found a better company to put your money into.\n\nI sold a lot of AMD recently around $170-190 ranges. And moved the money to CRWD, TSM and GOOGL. And what is left of the money is just sitting in MMF, in case drastic dips happen.. hopefully that move will pay off i will look into it in a year.\n\nThat was tough to sell because some of the shares were from when AMD was at below $50.", "I’d hang onto SMH.", "Because Jan was kinda ugly, if it comes cool we rip like crazy (my current speculation).  I think market is fine with Core at 0.3% though (consensus).\n\n*They shouldn't sell off* on a little hotter but market is irrational and it do what it do.  All you can do is buy the dip and hold.", "I was just reading an article on it.\n\nThe republican presidential candidate said he opposes a Tiktok ban because it empowers Facebook. He called Facebook an enemy of the people and very bad for USA while acknowledging the national security risk of Tiktok.", "Fortunately it shouldn't be that bad and also Fed ignores energy as they should.\n\nJust speculation but I believe if core is 0.3% (street consensus and Cleveland Fed expectation) or below, market will be happy.", "Daylight Saving", "yeah, this gets me twice a year as well......they manipulated the clock 1 hour over the weekend :- )", "It's incredible how much we take YouTube for granted.", ">BA is looking tasty right now\n\nI am staying away from them. Just looking at charts and price action and nothing more. When there is something fundamentally broken in their processes like safety and QA, i'd just move on. Boeing could get hit with another lawsuit worth billions with how much lapses have been documented on them recently.\n\nBuying Airbus would be the move.", "I was getting slammed with downvotes saying GOOGL was on firesale at $130-$131.\n\nJust gotta ignore all the oblivious people here.", "MELI is a monster. I finally got my paws around a small stake when it dropped to current levels. The tailwinds that are LATAM adoption of digital payments will last decades. Most of my family in South America still does most of their day to day in cash.\n\nI would buy a bigger stake, but the reality is that it'll always be a volatile stock so I wouldn't be comfortable with it being a massive part of my portfolio.", "Problem is many are saying Permian may be peaking or close to it?  So those assets are slowly declining in value.\n\n>I actually think it's undervalued now primarily because a few years ago Conoco Philips purchased 200,000 acres in the Permian for around $10 billion. TPL has a market cap of around $11 billion and owns 4x that land\n\nWithout a comparison of proven reserves this unfortunately says very little.", "Yes! I have never seen another person talk about this stock and it's on my favorite holdings.", "Samsung is wildly diversified and carries it's own risks centered around family ownership and geopolitics, but it might be the best play around memory design with it's own foundry business at current valuations.\n\nIt's not an easy play to register and own a foreign holding with currency translation risks, family ownership-minority ownership potential divergence, and difficulty splitting the different businesses (consumer electronics, financing, smartphones, memory, foundry, etc.), but by nearly all metrics it's undervalued.", "Took a hit this am but steadily rising.  Market Cap around $680b about 3 times more than Intel. thanks to the CHIPS act a new facility in Arizona is under construction.  Future is bright, I picked up some more this AM.  Although, i would like to know other thoughts on the WSB talking about TSM lately.  Not sure if it’s a good or bad thing.  Does anyone else consider TSM a meme stock?", "What's your bull case for WBD?", "Jensen is personally insulted and just for that is going to pump the stock another 20%.", ">MSTR up pre market.\n\nof course it is. its basically a btc stock.", "Am long. Look at pages 14-18 of the presentation slide deck from the most recent earnings, as well as pages 7-11 of the shareholder letter from the same earnings.", "Always wonder about this company as they have had steady growth in a dog eat dog business.  Always thought they would be brought by Solenis.", "Got it ty. But I don't understand how that helps us value vs the CP acquisition.", "I'm kinda excited to see what happens.  I'm sitting on the side for now, want to see how they perform as a public company, insider behavior etc but who knows I might buy in.  Do they have financials and history up already?", "🤣 woa woa there.\n\nStop spreading stuff like this.  People are totally drained of all their savings since student loans resumed nearly 6 months ago.\n\nPowers at be are hiding the truth and everyone is living on credit cards!  They're collecting bottles in the trash for the deposits it's so bad.", "[It's an enigma](https://i.imgur.com/OACqDzW.jpg)", "I think it would see a test around $772, which would be a drop of over 10% from the high. It had support around there in the past 30 days. I’m not a technician, though. I use technicals as supplemental/scouting material, not as a cornerstone.", "Nvidia conference is 2 weeks from now, good possibilility for it to shoot up", "Wow people really want that Viagra thru online prescription?", "8:30 AM ET. [See Calendar here](https://www.marketwatch.com/economy-politics/calendar) for dates/times.", "> Everyone\n\nNot really lol.\n\nMany of us are just long knowing that most likely it's lagging and recent blip was temporary.  It has zero impact on the critical question, \"should you be invested or in cash?\"\n\n*And if it ends up stubborn and taking a little longer than expected, so what?  How is this information in any way actionable or useful?  It literally changes nothing.*\n\nThis is the thing I just don't get.  People obsess about CPI or PCE when it has no impact on whether or not you should be in at all.  Zero.", "AMD up 16% over the last 30 days.  \nSMCI up 41% over the last 30 days.   \n\"Bought the dip\"", "What dip", "I knew goog at 132-133 was probably good but didn't have any money.", "I think it's the bottom but time will tell.  I bought on Thursday late.  \n\nEither way it was a great price and if it doesn't fall further it could pull out of the pullback / consolidation phase upward in the near term.  In the long term it's going up.  \n\nEither way it was a sale while it stagnated all these months and got wealthy off other stocks.  Very happy for this current price.  \n\nHope I'm right, never claim to always be.", ">bottom\n\nthey're both like 10% off of bull market inflated highs...", "I wouldn't say this is about CPI at all. \n\n\n What's currently being exposed is that large caps ex-tech have kind of stunk lately. It just was blocked by tech until NVDA imploded Friday.", "yep.", "And you should buy the dip because hot inflation means companies are pushing higher prices.  While jarring and unfortunately souring on unreliable emotional vibes, incomes are still outpacing inflation.  It also means stocks are becoming increasingly more valuable as well and growing revenues, profits.", "Inflation = higher prices = higher revenue and profits.\n\nI truly, truly do not get why that is so hard for people to grasp.\n\nThere's this very persistent myth that inflation in the 70's destroyed profits.\n\nActually S&P EPS soared.  Orange line:\n\nhttps://i.imgur.com/7yuLEEE.png\n\nI've been telling everyone I know this for so long and it boggles my mind why people don't get it.\n\nThe only reason market prices didn't soar was because Fed was stupid and over-hiked (also poor messaging).  Valuations went down because of yields being too high but companies did great.  \n\nThis Fed won't do that and they are finished with their hiking campaign already.", "time to get in was at $10 and $11. Anything can happen from here. Their cars are really cool though. Id buy one if i was rich.", "Or maybe we are getting out of Recession ![gif](emote|free_emotes_pack|hug)", "we were in a recession, they changed the definition.", "If I wasn't already so concentrated in META I'd consider buying more. That being said it's been a fantastic run-up and $500 was always around my price target for 2024 (end of year). But another good earnings report or two is all it takes. I'm really liking the recent trends with Instagram beating out TikTok.", "The GOP nominee said FB was an enemy of the people while also saying he opposed banning Chinese owned Tiktok. That's the best guess I have for this drop.", "Stocks pull back.  After the record run up it takes time to digest the higher valuation and people get skittish and take profits when it goes up from a low.\n\nUnless you're day trading I wouldn't be worried.", ">drop 6% in just 1 day - I don't see almost any other Ai stocks doing that.\n\nDid you see NVDA on Friday?\n\nA lot of names that have had immense runups lately are selling off. That crazy coal company AMR is down 6% today too. \n\nIt's OPEX week and there's been crazy bullish sentiment. A selloff isn't that unexpected.", "Perhaps related to comments made by Trump this morning:\n\n\\-  “Without TikTok, you can make Facebook bigger, and I consider Facebook to be an enemy of the people.\"\n\n\\- \"I think Facebook has been very bad for our country, especially when it comes to elections.\"", "NVDA is not inflated.  It's pricing in more beats and raises, which will continue to lower forward PEs.\n\nMarket is about growth trajectory.  That said META is a giant buy and hold.", "highly unlikely it'll grow that much.", "I normally wouldn't buy Mag 7, but GOOG dropped to my intrinsic value, and it was a superior business to a couple of my current holdings. I made it 7% of my non retirement portfolio.", "its been rough since 21. I made 5x on it in 2020 when it hit 97-104", "Last earnings had dissapointing outlook. With the Figma merger abandoment and threat of Sora I think they will reiterate a dissapointing outlook which would cloud a possible beat.", "Did you see the other post about web traffic? If not, very interesting...\n\nEither way, what if the traffic is for cancellations?  What if all the adobe computers home pages are set to their site?  I would taker it with a grain of salt...", "[removed]", "agreed. Its the volatile time of year anyways", "> 9-day VIX is elevated to levels not seen since the Oct/Nov volatility and shock of 10Y rising so high, before Jay calmed everyone down with pivot signals.\n\nVIX9D is at 16.24. The peaks in Oct/Nov were 22+. This thing has barely moved \n\n> Buy the dip folks\n\nWhat dip?", "[removed]", "expect comment sections to be now have ads shortly. Revenue growth must happen at all costs now.", "An unprofitable business that relies on free labour and pays ita CEO $200 Million a year. \n\nThat said, the licensing agreements they could produce by selling their data to AI companies could be lucrative, though the reddit community may not like that.", "My knee-jerk reaction is to laugh at it and short it, but so many redditors also have this opinion so it may be very wrong.", "Gonna buy $700 for the pump and dump", "I love how highly specific the question is.", "Who's Canadian and not investing in canadian penny stock?\n\nMe\n\nJoke aside, I use wealthsimple when trading in canadian dollars. There's no commissions fee. I started to use Ibkr for my Usd trades and it's been great so far.", "Bro... there's a little market timing or being like Buffett with 10%-20% cash.\n\nThen there's full on \"I genuinely believe I have access to secret information of the next black swan\".\n\nThinking you are the next Nostradamus.  How do you guys end up here?", "Maybe $300 I'd start nibbling, only buying seriously in $250-$280 range. Conditional on met coal prices though. My fair value was generally $350-500 range, would want wide margin of safety.  I had sold down 75% of position in low/mid 300s mostly.", "I love thinkorswim by TDA (transitioning to Schwab)", "I love Thinkorswim's interface (owned by Schwab). Some people prefer TradingView for their interface and use whatever broker.\n\nI just moved to Fidelity because I wanted fractional shares. I don't want any cash in my accounts.", "[removed]", "Which comes to 0.4% MoM and 0.3% MoM for core.\n\nSame as street consensus.\n\nJust pure speculation but I say we beat on core.  If headline misses market may or may not like it but regardless buy the dip.", "In terms of stocks, it'll be fun to watch from a safe distance. In terms of the platform? I'm still on [old.reddit.com](https://old.reddit.com) and I'm expecting some big changes that will probably annoy me.", "i find it interesting. most IPO stocks go down after an initial excitement though, so i will wait a little and maybe pick them up for half the price at some point", "They probably haven't profited because all the levers are not pulled yet and they just want to keep building up a massive moat / network effects.\n\nIf I had to bet they can put out some absurd profitability numbers if they wanted to.\n\nCould pulling those levers lead to a decline in what makes the site awesome?  Maybe and as a user that does concern me a little. But as an investment it could still rocket for a long time.  \n\nThere really is NO alternative to Reddit for what it does.  Clean, crisp and lots of text.", "r/stocks\n\nWhen we just hit ATH and SPX is -0.3%.", "Infinite red? We’re still at ATHs…", "I'm actually going to be fair and say that this person has a point here. \n\n\nLarge caps ex-tech have not been trading well for the past few weeks. I mean, there was a chance for them to block the S&P from being pulled lower by semis getting destroyed and they flopped. \n\n\nI think the only reason the Dow isn't below 38k already is because of tech stocks, and that reason has been taken away.", "Company is heavily undervalued and market will recognize this eventually. They are the biggest player in the fintech space and showing clear signs or reaccelerating revenue growth. They are trading at an 11 forward P/E. Guarantee you it doesn’t stay this cheap forever.", "Why? I don't know what the stock does when it initially IPO's but from a business perspective imo it wasn't appealing when people talked about it possibly going public about 3 years ago and still isn't.  \n\nhttps://www.cnn.com/2024/02/23/tech/reddit-ipo-filing-business-plan/index.html  Reddit hasn’t turned a profit in nearly 20 years, but it just filed to go public anyway", "Is that a question?", "Btc, eth and matic are all trending up, rddt won’t do too bad, also they will keep adding onto these positions. Rddt is basically doing what mstr is doing now. They will probably do mass layoffs and just keep a skeletal crew running the platform and posting crypto memes like Micheal saylor does all the time.", "Doesn’t matter what we think. The question is, “does it serve a purpose?” If it does, go for it.", "NVDA’s fundamentals are extremely strong. The question is whether or not it’s sustainable, or just a one off huge investment in AI compute power by the rest of the mag 7.", "ARM post-IPO lockup ends tomorrow. No clue what’ll happen but it’s worth keeping an eye on. SoftBank owns 90% of the shares…", "CVNA is up over 800% YTD. In mid-March.", "[WingStop](https://i.imgur.com/xD1ximy.jpeg) (image from March 7th). It's not even growing that fast (like 20-30% growth).", "sure. lots of them. there are 50.000 companies listed worldwide", "NVDA is very fairly valued based on forward earnings... \n\n* With beat raise even more so.\n* Cooling inflation and cuts faster than June / July also would make it super undervalued.", "If the meta was sold at a loss be aware you will trigger a wash sale of you rebuy it", "meta", "If you like Meta for VR, Sony might be an idea. It always seems to flounder but I'm in it for the long term. For the social media angle, Tencent is also still very cheap and has earnings coming on March 20 -- but the China aspect is a huge consideration. Both pay small and growing dividends like Meta.", "You say this constantly and we keep hitting new ATHs.\n\nDo you mean \"peak for a week or so\" or \"peak for a month then new ATHs\"?\n\nBecause that's the only way your comments make sense.", "Thats fine. Its that time of year. We could be flat til Q4 ", "I saw that episode, and brought some Airbus stock the next day. Theres two companies that basically control commercial air travel...and one is messed up. Airbus has a monopoly on planes people actually trust their lives to.", "Well it wasn't the very next day.  \n\nThe latest LWT episode was about how corrupt it is that Doctors get to regulate themselves through state licensing associations.", "Guy who is bearish because only a few stocks are going up but also bearish because stocks are going up too much and even more bearish because the stocks aren't higher than the peaks of 2021 bubble territory if you adjust for inflation and hugely bearish because [...]", "You typically don't see 4% drops like that on no news. Perhaps it has something to do with Tiktok's ban not going through. NVDA, the king of AI stocks, is down less than 1%.", "Except AAPL and GOOGL which got the most sold of the Mag 7 are very green today.  Looks like they bottomed.", "Nah if it is literally 3.2% instead of 3.1%, itll sell off market wide. Everyone is wanting Fed rate cuts but they won't do that unless inflation cools.", "That's my guess. Word is that candidate met with a hedge fund manager/megadonor that owns a large stake in Tiktok and now that candidate suddenly opposes the ban.", "We really do. I see facebook getting all this love from the  market, but it isnt half as important as youtube. I guess it must be the instagram which admittedly i dont know much about", "I wouldnt open a big position. Buy in sequences so you dont miss the dip. Id buy a 3rd, with the intention of putting in another 1/3rd if it drops another $10. And so on and so forth. Its already beaten to pulp.", "EADSY is superior by far.  Extremely well managed, cheaper valuation.  Consistent profitability.\n\nI love America but it's a no-brainer over BA unfortunately.", "Google dips are easy money. Every time it drops 5-10% I buy it up and it mostly bounces back within a week.", "I have kept my max position around 5-6% mostly, although I am pretty happy letting it organically run up past that level to over time given its track record", "That's possible, though TPL has well over a decade of proven reserves of oil. They're also leasing land to wind farms establishing even more royalties for the future, a long with potash mines. So, it's not 1 for 1, but a decent proxy. TPL owns some of the highest quality deposits in the Permian. \n\nThis one is moving based on legal decisions right now (mostly).", "I love the business, but the ownership struggle is keeping me from owning it. The way they constantly add new lines of business is awesome.", "Do you have any thoughts on the board disputes?", "No because the western world still relies heavily on TSM for semis. Once competitors actually build infrastructure, like you mentioned, and start selling, is when TSM will start to drop. Until then it’s clear skies.", "Max picking up more users as they branch into latin america. Debt payments and free cash flow to start improving better than the street anticipates. A potential buyout for WBD like with PARA. The current ceo to get replaced and for DC/IP to get back on track. The cash flow headwinds warning in their recent earnings was a slap in the face to a lot of bag holders. My entry was 9.5 a share with 2.5k so considerably better than a lot of other bagholders. Am considering dumping all my bags as its probably better to throw that money on wonderful businesses and not have to deal with more of their headwinds and years of underperformance.", "Thanks a lot! So it seems that their TAM is $63B, which is roughly nearly 3 times their current market cap, is that right?", "It's one of my highest conviction holdings actually. The company is incredibly long.term focused, family run, and is seeing a flywheel from their investments. I hope they get to continue to execute rather than being acquired.", "I was going more for the Permian Basin longevity we mentioned. I was trying to find more in the CP acquisition too.", "I’ve only gotten the overall “would you like to participate” and “you’ve been selected, you’ll get an email about how to fully enroll” so far. Haven’t done any digging to see if they have the financials posted anywhere, though.\n\nI won’t lie, it’s a pretty interesting company overall. Facebook/Meta is a powerhouse, so it’s not like it’s impossible for Reddit to be really worth something.", "u/AP9384629344432\n\nJokes aside, people also need to know those figures do NOT include 401ks, increase in networth from home equity, OR money moved into brokerage accounts for investment as yields rise.  With checking and savings yields so low:\n\nhttps://fred.stlouisfed.org/series/SNDR\n\nIt's not a surprise people would move them into MMFs, bonds, stocks etc.\n\nStill, the resilience of those balances relative to 2019 is remarkable nonetheless.  Expect a strong 1Q in results IMO.", "[Whatever could be the cause?](https://i.imgur.com/yvX9SaP.png)", "Yea really shocking... absolutely no one said consumer and economy would be crazy strong in 2024...", "I could see that one. I was looking around the 50 day moving average, as well as that little dip right before earnings which is around $700. $770 would still be about a 25% pullback from its intraday high of $974, so not insignificant. \n\nI'm limited in my TA too. I know enough to avoid FOMO and help pick buy points, but I'm no expert.", "That was certainly the bear case for a while, but I personally have never seen the bull case as being that and I think the market is coming around to a different viewpoint. Hims actually offers a lot of different services/pharma goods and does so at reasonable prices with no insurance involved for speed/simplicity. Average order value per user has exploded, revenue growth has been lightning fast, and self-reported views of their competitive markets show growing domination vs competition", "It impacts people who want to time the market to know when they should be in. It's a 20% difference in portfolio value for a lot of indexes atm. Of course, people can lose, but they can also win when timing.", "It impacts people who want to time the market to know when they should be in. It's a 20% difference in portfolio value for a lot of indexes atm. Of course, people can lose, but they can also win when timing.", "SMCI *almost* got back into triple digits, gotta strike while the iron's hot!", "Idk if it's possible to get -41% dip unless the CEO executes someone on stream.\n\nSMCI going from 1,229 ATH to 1,083 (my buy point) is a 13.5% dip.\n\nAMD going from 227.30 ATH to 199.85 (my buy point) is a 13.7% dip.", "What is your expectation for the impact of CPI tomorrow?", "You think NVDA is finito or this is temporary correction and new ATHs after 1 or 2 beat / raises?", "Oxford dictionary under recession:\n\n\"a period of temporary economic decline during which trade and industrial activity are reduced, generally identified by a fall in GDP in two successive quarters.\"\n\nPeople forget the first part and remember the second. Generally they both happen together, but in 2022 they did not. GDP shrank, but trade and industrial activity were pretty strong (speaking of USA).", "Added more META and HCC today ;)\n\n(Even a blind chicken sometimes finds a grain: META is one of my three multinaggers, hoping HCC will be my next :)", "People are way getting too caught up on TikTok being a huge threat.  You don't even need a ban for META to thrive.  There's more than plenty strategic non-overlap.\n\nThat's just positive black swan if it happens.", "I had to re read this a couple times, wow ", "I won't just bought more at the dip", "Do you think the downtrend will continue for a bit given that there is no news?", "So trump thinks a chineese spy app is better tha Meta who at least is regulated in the usa?", "You have been downvoted. Is it because you\nSaid Meta is a hold (which I own) or because you said Nvd is not inflates?", "Why, new Corollas go for about 22k and new Accords for about 25k.\n\nMaybe the 3k I just invested won't buy the whole car, but maybe it'll buy a good portion of it. 10 year average is 18% returns on QQQ (I realize I got QQQM but basically same thing). ", "In 10 years that $3,000 will be worth around $30k at a 27% interest rate….u good ? That’s entirely possible in the next ten years and the market can get unrational really fast if this AI revolution is actually happening\n\nI bought a shitload of QQQ and SOXX in my Roth Ira recently. Been DCAing into those ETFS for the past five years and no complaints. The next Industrial revolution is among us king", "💪", "Yea. My avg is $50~ - not gonna lie I bought into w/ the portnoy hype.  This is my only crap stock and it sticks out like a sore thumb in my portfolio", "[removed]", "Its still the highest since November but agree that's a good sign not too much vol expected 👍.\n\n>What dip?\n\nThe current dip plus anything tomorrow if it comes.  Personally I think it comes cool but I don't hang my hat anything so short-term.  Just know SPX moons this year.", "1.  Please do not insult or be rude.\n2.  If anything you are the one misinformed.\n\nSee discussion and data here:\n\nhttps://old.reddit.com/r/stocks/comments/1baesqb/rstocks_weekend_discussion_saturday_mar_09_2024/kubndn4/\n\nHome ownership is in a FANTASTIC spot.  Reality is that buying a home was always tough.  It's fake news nostalgia of an era that didn't exist.", "Minorities, disabled and poor.  All marginalized groups historically left behind doing fantastic:\n\nhttps://fred.stlouisfed.org/graph/fredgraph.png?g=1i1K1", "Real disposable income soaring:\n\nhttps://fred.stlouisfed.org/graph/fredgraph.png?g=1i8x3\n\nPoorest doing fantastic:\n\nhttps://fred.stlouisfed.org/graph/fredgraph.png?g=1hSVw\n\nReal wages soaring:\n\nhttps://ycharts.com/indicators/us_real_average_hourly_earnings", "Yep, Facebook collapsed after its IPO in the coming months from $38 to $19 because they didn't have much profit. Then they found ways to monetize it and it hit $500 last week. I doubt RDDT will be able to branch out into other industries or social media but you never know, they could buy tiktok.", "I'm so torn.  As a Redditor I'm a little scared the place I love dearly will change and be forced to grow into something totally different.\n\nAs an investor with the potential to take part in gains, I'm super excited.\n\nThe best of both worlds would be if I could invest in Reddit (or gains through ETFs) and another more niche competitor sprung up to resemble old school Reddit which is why I fled other social media sites in the first place.  \n\nLet the masses go to and continue to help grow FB, Reddit, Twitter, etc.", "shorting is too obvious, at least right away.  i expect some kind of pump and eventual fade.", "I was thinking about shorting the absolute shit out of it but there is always that chance that it all goes wrong and for some reason it shoots up 300% on open", "You timed it pretty well 👑!", "Interesting take. Thanks! $250 is my \"start thinking about it\" point, for what its worth.", "Off topic:  Not bringing up stocks or the stockmarket.\n\nAlmost any post related to stocks and investment is welcome on r/Stocks, including pre IPO news, futures & forex related to stocks, and geopolitical or corporate events indicating risks; outside this is offtopic and can be removed.\n\nPosts & comments that are purely political, religious (dealing with morality), or focusing on other types of investments not related to stocks such as real estate, crypto, designing websites, or even selling sneakers will be removed.  An example of what wouldn't get removed:  Discussing real estate when related to the ETF VNQ or real estate bubble affecting the stock market.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "Yeah, I am not a fan of the new Reddit design. I've been on the old one for a while, but I bet that one goes away now that Reddit will have shareholders to answer to.", "If something happens to old.reddit i'm out.", "Spy's ATH is 518.22, and now it's at 509 -> 1.8% below ATH (so far).\n\nQQQ's ATH is 448.64, and now it's at 435.7 -> 3% below ATH (also so far).\n\nThese figures can get much worse tomorrow on a bad report.\n\nSince Friday + less than 45 minutes of today, we have successfully undone the entire last week's gain.", "don't agree on signs of accelerating revenue growth or profits. this company is in the \"illusion\" phase - where the fundementals look great but is based on growth (that will not happen) in the future.\n\nthis is how value traps are created. companies that look great on paper but are on the inflecting point slowly dying off and thus their forward metrics are too optimistic.", "Right.  How does Reddit make money?  Let the WSB’ers have fun w/ this.", "Expecting some major price action, honestly. Sure, SoftBank could hold and make money long-term, but I suspect they'll sell to cover other losses that this could pay off. Who knows.", "But unlike Nvidia ARM doesn't really any case for massive long term growth (their business model isn't really great, they aren't making a lot of money and facing potential competition from RISC-V etc.). \n\nI don't really see any real \"AI\" potential for them (even Intel IMHO is much better positioned for that than them).", "Disgusting. Why did it even go up if it missed earnings?", "> super undervalued\n\nI doubt that's possible. Also the estimates very optimistically assume that they will both be able to maintain very high growth and insane (understatement) profit margins long term.\n\n Not saying that can't happen knowing AMD and especially Intel but still if one of those things is no longer true in the upcoming year or two they are very overvalued (just high growth wouldn't be enough if anybody starts competing with them on price even with inferior products)", "No I made 5k off of the dip. I also was thinking of palantir as well with AI and gov contracts.\nI jave 15k or so to invest. Maybe 50-50 on two things or go back in meta again or something else?", "I felt vr still not that profitable... what do you think about ai from palantir or meta? Or streaming with netflix? I feel netflix will keep raising prices and with ads tier they might generate even more revenue", "And theres a new incident today where a 787 dropped in altitude and caused 50 injuries..", "Not 100% sure who in particular you are referring to but yea this sentiment is very common here and elsewhere.  Always an excuse why market is \"unhealthy\" which is another way to say \"I made up my own reasons for why market is unfair\".", "Disagree, when stocks have been flying and are up 40%, 80%, 260% so far this year, a 5% did doesn’t need any bigger reason", "The dangerous reference actually isn't related to Apple and Google at all, it's referencing the fact that semis have gotten so dangerously big, that they truly will push everything around.", "I think that's just some bs narrative that people tell.\n\n>Everyone is wanting Fed rate cuts but they won't do that unless inflation cools.\n\nIf you look at bond yields, they are pricing basically one cut this year.\n\nNo one cares at all if cuts get a little delayed here or there.  What difference does it make?\n\nAre you actually going to change your investing behavior if you have to wait 6 weeks from June to July or whatever?\n\nOnly thing that matters is that Fed is modestly stimulative, financial conditions remain loose, credit is flowing and Fed does not hike.\n\nWhich just about 100% it doesn't absent a black swan.\n\n------\nEdited:\n\nCore matters to Fed, I don't think people panic because of one time increase in YoY headline.  It's possible and day-to-day movements don't mean much to me but it won't be that big of a selloff.  Long-term investors literally don't care.\n\nThat's probably why 9-day VIX is pretty high compared to recent months but 30-day, 3 month, 6 month, etc. are pretty reasonable.", "I just don't think we replay February unless core CPI comes in over 0.3 MoM. If it does, it's very possible, but I'd still guess we get what we had in January over February where the S&P dropped over 100 points or over 2% before bouncing hard due to options stuff into the end of the day.\n\n\nIf January, then we flirt with falling a percent, then reverse and finish close to unchanged.\n\n\nReally, my guess is a meet and we see nothing special.", "Yeah, I think META is more than Facebook. And truth be told Facebook is widely used worldwide, just not that much in the US anymore. Plus you have WhatsApp which everyone in the world (bar the USA) uses to communicate!", "Your comment made it sound like you bought anywhere in the $12-20 range. Didn't think people down 4-5% with that 4-5% being near all time low were called bag holders.\n\nBut then again if someone was actually down 40-70% they probably don't mention they own that stock lol.", "Ah ok understood.  Longevity is different from productivity though.  Wells can run for decades but produce little.", "I've been very pessimistic so far, but if the stock price is cheap enough I might scoop up a handful just in case.", "Net worth is soaring, by the way... [Figure](https://i.imgur.com/BuXYLbe.jpeg). Or as a [table](https://i.imgur.com/5wSyJnj.jpeg). It's 167K across everyone. This is as of the 2022 Census data, after last week's update.\n\nThis doesn't include the equity gains from 2023-4 though, if I understand right. So this is despite the drawdown in 2022.\n\nBy the way, I wonder what happens when all those very wealthy seniors pass down their assets to their children.", "[I was banging the table on a strong consumer for a long time now](https://www.reddit.com/r/investing/comments/11c29pn/here_is_data_showing_that_the_us_consumer_is_not/). It wasn't as popular back then though. Similarly [in January 2023 too](https://www.reddit.com/r/investing/comments/10izb7y/an_update_to_eurous_macro_situation_ft_eurozone/) and even [July 2022](https://www.reddit.com/r/stocks/comments/w9qedj/my_cherrypicked_take_on_earnings_reports_so_far/).\n\nBack then it was a bit tougher but if someone is *still* bearish the US consumer in the year of two-thousand-and-twenty-four after basically none of the bearish predictions came true, idk what to tell em.", "Fair take, sir.", "I dunno. What's the moat? They sell generic drugs at a big markup, and more competition will continue to enter. People are embarrassed to buy what they're selling, so discretion is important and the brand value can only go so far. Wouldn't be surprised to see Amazon completely wipe these guys out with an expansion in Telehealth.", "Setting aside “time in vs timing”, what’s the specific signal you’re looking for with CPI? Are you looking to pile in with the rip if it’s a cool read?", "How exactly does it make a difference?\n\nIf it comes hot cash is terrible.  Not just because it devalues in real terms.  Higher prices = higher revenue and profits.  In the 70s [S&P EPS](https://i.imgur.com/7yuLEEE.png) soared.  If it comes cold it'll rip and you need to be in.\n\nFed has already signaled no more hikes.  Market is not going to seriously crash due to them delaying cuts a little.\n\nCrash would come from something else external now (IMO extremely low probability at this point of a non-manufactured crisis).  Not the Fed or CPI.  The latter is no longer worth much information wise.", "My expectation is for nothing special to occur at all. \n\n\nI know, boring and unexciting, but you really need an under 0.3 core CPI number to get any type of interesting reaction at all me thinks.\n\n\nMaybe there is a slim chance of a replay of February if we come in over, but my guess there is that we'd prob just fall 1% and have vanna charm stuff pull us back up like January instead.", "Probably didn't perma top on Friday.", "It's crazy how well people did in terms of keeping their jobs and they DESPERATELY want a real recession.  Like our leaders are working so hard to protect people that just shit on them, pleading for pain.\n\nI can't help but facepalm at the stupidity.\n\nWe are recovering from rolling recessions and that's good fucking news people!", "Plus as I posted yesterday:\n\n\n On META vs. TikTok ([FT article](https://www.ft.com/content/7db1c1b3-5a61-4dee-a922-ade8b9c77522))\n\n- [App downloads now favoring Instagram](https://i.imgur.com/YUffpMx.png)\n- \"Instagram’s monthly active users reached 1.47bn, with a rise of 13mn in the final quarter of 2023, according to Sensor Tower. TikTok’s active users reached 1.12bn, with a decline of 12mn in the final three months of last year.\" [Graphic](https://i.imgur.com/vKKv3VL.png).\n- \"However, TikTok continues to gain better engagement from its more than 1bn active users worldwide. Users spent an average of 95 minutes on TikTok in the fourth quarter of last year, compared with 62 minutes on Instagram, 30 minutes on X and 19 minutes on Snapchat\"", "Up to you, I've been in for a while I'm not buying or selling.  Hope your trade works very well for you.", "I'll answer deliberately vaguely...\n\nI think this selloff is driven by short term machinations of the market. At some point you run out of buyers and need a pullback. 5% drops on the S&P historically have happened every few months, and numerous people who are smarter and more experienced than I have been saying that market dynamics are showing a pullback is brewing. \n\nAs always, my personal philosophy is buy stocks when they are below your fair value of the company and hold until your thesis breaks or you find a significantly better opportunity. So basically, I have no idea what will happen in the short term. It wouldn't surprise me to see a continued pull back, but there's no panic anywhere.", "Depends on who is paying him at the time", "Probably because they spam this whole thread with continues posts.", "18% returns from today's valuations--that's a bold prediction I gotta say. Especially considering how much cheaper the market was in 2014 even w/ zero interest rates. Apple had a P/E ratio sub 15 in 2014.", "Okay. This is basic math. 3k growing at 10 percent a year in 10 years is about 8k. That's notwhere close to 20k and a new car is going to be 30k+ today let alone in 10 years.", "> In 40 years that $3,000 will be worth $135,000 at a 10% interest rate….u good ?\n\nWhat does that have to do with 3k in 10 years being able to buy a 30k car? Compute the growth of 3k compounded annually. It becomes about 8k. Are \"u good\"?\n\n> I bought a shitload of QQQ and SOXX in my Roth Ira recently. Been DCAing into those ETFS for the past five years and no complaints. The next Industrial revolution is among us king\n\nCool. I own lots of qqq and semiconductors too. That's got nothing to do with this.", "600 is your loss? Id go ahead and take it. Tax loss or offset gains will help a little.\n\nI lost on hype stocks too and now index.", "[removed]", "[deleted]", "TikTok as a standalone entity controlled by a US Corp is probably worth 10-20x what Reddit might IPO at, and that's with me being conservative. That's a wild statement that Reddit could buy TikTok.", "There is so much potential, but I don't see them going for it. Just fixing media on the site and make it worthwhile to post on reddit first. There are a lot of people who want to post but don't want to be influencer or have their face out there. It could be the only searchable social out there with the users giving all the contextual data to find stuff. Reddit users ad communities have the biggest influence on \"the algorithm\" whereas the other big ones just makes their content lost in the sea by design. This human curating is what's making reddit interesting and they should embrace it. There is a reason adding \"reddit\" to search queries is a thing. I just hope they don't go the tumblr way and try to clean the place.", "smart", "Thanks! In hindsight I would have been better off doing nothing but 6% of my portfolio (of my net worth in fact) in a single small cap coal stock seemed reckless. And the discounts remain in the coal space anyway.", "https://i.imgur.com/grOd356.png\n\nReposting this", "+1. I'll move to lemmy or something similar before using their shit platform. I'm also not a guy who plays options but I'll be buying conservative puts against Reddit when they open up.", ">These figures can get much worse tomorrow on a bad report.\n\nMaybe, I don't try to predict stupid market's irrational day-to-day movements.  All I know is that SPX will moon this year.\n\nHowever if they try to spin higher prices as bad news, *buy the dip hard*.  Higher prices = higher revenue and profits that are scaling.\n\n>Since Friday + less than 45 minutes of today, we have successfully undone the entire last week's gain.\n\nGreat, we still hit ATH.  Market climbs a wall of worry and that's why we bulls make the big bucks while bears get poorer in real terms.\n\nIn exchange for being hit with a giant black swan, we steadily earn our equity risk premium and enjoy trillions in net inflows of divies, buybacks, paychecks, 401k dollars, endowments, pension funds, etc. that create constant positive upward drift.", "That’s okay if YOU don’t believe they are accelerating revenue growth or profits, the fact is if you look at their earnings reports they are. \n\nLast two earnings report were double beat on top and bottom line. Q1 2023 their revenue was 7.04 billion, Q4 2023 their revenue was 8.03 billion, that’s a 14% increase in revenue in less than a year. \n\nThey over doubled their free cash flow going from 1.1 billion to 2.47 billion. \n\nTheir shares outstanding are continuing to go down every quarter as they are doing tons of buybacks. \n\nPayPal sentiment is at an all time low right now which is the exact time to scoop up shares of a company that’s still clearly performing.", "WSB is mentioned as a risk in the S-1\n\n''In 2021, the market prices and trading volumes of certain securities, such as GameStop Corp., AMC Entertainment Holdings, Inc., and other “meme” stocks, experienced extreme volatility. The rapid and substantial increases or decreases in the market prices of “meme” stocks may be unrelated to the respective issuer’s operating performance or macroeconomic or industry fundamentals, and the substantial increases may be significantly inconsistent with the risks and uncertainties that the issuer faces. This volatility has been attributed, in part, to strong and atypical retail investor interest, **including as may be expressed on financial trading and other social media sites and online forums such as r/ wallstreetbets, one of our subreddits. Given the broad awareness and brand recognition of Reddit, including as a result of the popularity of r/ wallstreetbets among retail investors, and the direct access by retail investors to broadly available trading platforms, the market price and trading volume of our Class A common stock could experience extreme volatility for reasons unrelated to our underlying business or macroeconomic or industry fundamentals**, which could cause you to lose all or part of your investment if you are unable to sell your shares at or above the initial offering price.''\n\n''How does Reddit make money?''\n\nIf what is a fairly straightforward social media site that doesn't pay the people who moderate it isn't making money after 20 years...", "I strongly suspect they’ll dump out hard. The financials for the company as it stands right now are terrible", "I said IF cuts come faster than many think.\n\nIt's very fair valued currently and even Aswath Damodaran, very conservative \"dean of valuation\" said he expects more beats and raises.  Admitting it is a \"good trade\".", "You would have done great in any of these stocks if you bought at the right price. At this point, it's probably more about picking one you believe in long term.\n\nYou could always just buy back in Meta, especially if you made the profit and won't be tax loss harvesting. I think Palantir is a very different type of company - far outside my understanding, like a defense company in some ways. It seems like there's a lot of potential here but it's up 220% in the last year. It might just keep going up up up -- but can to stomach a 50%+ drop? \n\nI've never owned Netflix but it constantly surprises and impresses me as a company. I wish they owned more IP, since I see this as a more durable advantage long term.  Disney is integrating Hulu and, at some point, someone competent is likely going to swoop in and acquire Paramount or Warner Bros. Lots of uncertainty in the media space. I like Sony since they sell to everyone:  https://www.nexttv.com/news/arms-dealers-rule-sony-pictures-reports-a-57-spike-in-fiscal-q3-profit-to-dollar281-million", "they still have contracts sold out for years to come because theres high demand than just airbus can meet. I still see airbus having greater pricing power in the future because of the preference for planes that won't fall out the sky.", "Not a stock like META. Maybe a small cap, but a large cap doesn't drop 6% randomly. I think this probably has something to do with the Tiktok ban.", "February 2024\t\n\nCPI 3.12\t\nCORE CPI 3.70 \n\nInflation Nowcasting", "Give it some time and maybe ill be a true bagholder when it makes another all time low", "True. \n\nI'm going to have to go into 10Ks to find the total production from TPL land. They cite \"royalty barrels per day\" of 23,000, but that's not total production. Conoco expected 200,000 BPD from their land, but not all of that is operated yet. So it could be more productive, but it's not apples to apples.", "Yes that was my point, not sure why people are downvoting me.  Your graph COULD be interpreted as \"well those balances are drawing down, albeit slowly\" but the counter is that it is probably just moving into other, better things since rates went up while back then we were in ZIRP land.\n\n100% agree networth is skyrocketing.\n\n>By the way, I wonder what happens when all those very wealthy seniors pass down their assets to their children.\n\nWhile boomers are known to be a little more aggressive with stocks, a lot of them still obviously have a lot of bond ladders and such.\n\nHome prices will ease as supply goes up, as they release properties and get sold.\n\nHowever, I expect a monumental move up in equities.", "Thanks! Yours too!", "Yah the prices are really bad. U can get just about every they sell for a fraction of the cost from overseas, from the same manufacturers too. ", "Discretion being important would be partially why people would use Hims no? As for moat its certainly the weakest aspect of the business right now I will grant you, long term it could be a mix of partner pharmacies and personalization of drugs but that is nascent right now. For price, you are paying a markup for convenience, same as many ecom business models.", "Thank you for this.", "Thank you, same to as well!", "Thoughts about the NVDA conference? Seems like a good time for the stock to shoot higher.", "18% returns would come close to the elite fund manager performances annualized. I don't think he realizes that kind of performance over a long period of time from an index is extremely rare. Expecting 18% from the QQQ again over the next 10 years is.... improbable to say the least.", "Let them go. They can't operate a calculator. 3k in 10 years will buy a 30k car they are *fine* no misculations happeing /s. Let them go back to their middle school homework.", "Disagree. Thanks for your thoughts. ", "If you own those names then stop trying to gatekeep.…must not be in the industry lmfaooooo\n\nGet over urself and get that stick outta ur ass ! U should be helping others not being fuckin RUDE. Next !", "[removed]", "I just sent you government data that says otherwise... Do you think it's a conspiracy?", "Big gains though, it was a good setup and great company.", "Still my favorite coal meme!\n\nProbably start my HCC position tomorrow. 👍", "I bought shares at $67, and sold at $121. At $67 I would've kept holding for a good long time, hopefully they would've made some good moves, etc. At this price? Right now? I'm not sure.", "> It's very fair valued\n\nIf estimates are accurate then sure. But that's a huge IF. Who knows what will this AI craze turn into, I wouldn't be surprised if it's a mini repeat of dot.com. \n\nOf course probably not in such an insane was as back then, there is still a more solid case for \"AI\" than for whatever happened in the late 90s but it wouldn't be extremely surprising if Nvidia turns out to be the new Intel (not current Intel the one from the early 2000s).\n\nNo clue what will happen really but there are some pretty clear parallels, Intel ended up being a near monopoly in the server/datacenter market for years but after growth slowed for a few years they stock price never reaced their dot.com peak ever again. (of course Intel being Intel fucked up some other stuff and actually was behind AMD for a couple of years until they destroyed them so it probably won't be that bad but still, the estimates are very rossy and speculative considering it's a almost entirely new market at this point). \n\nBack in 1999 Intel had a forward P/E of 22. Guess what happened next..", "Sony I had some but it got sold by limit stop when they dropped from 100 or so.. \n\nWith meta, it seems it dropped that much which cause my 8% stop to sell because of Trump tweet and something else? A bit fickle... maybe i could give it another shot \nwince i bought in initially because of ai\n Yeah netflix does surprise me too but it seems to be overvalued by morningstar rating...but again it surprises people with price hikes but people keep going there. \n\nI do have some disney I bought years ago and I am hesitant to buy into it now since their movies generally suck these days.\n\nPalantir could be solid with gov contracts and those are pretty stable for the most part..\n\nApple is another consideration but it doesn't seem to be doing that great.\n\nWeird thing is schwab equity rating gives netflix, palantir a C or hold because they are unstable. \nIt did give Apple an A and meta a B", "Maybe it does but even for a mega cap a 6% drop after being up 150% over 1 year isn’t ridiculous. Profit taking happens and is very normal", "You are paying for convenience, not bottom barrel pricing on the drugs.", "Here's my opinion if we're talking long term here. Their margin is only going down when bigger fish come in to compete. They're selling at literally triple the price of competitors in many products, and again it's just a generic pill. Their ad spend already makes them largely unprofitable (marketing cost is 50% of sales) as the only game in town - imagine in 5 years. \n\nAs for the brand, it's not like anyone wants a big box with the Hims logo showing up on their doorstep or will be in a hurry to discuss the product with their friends. Long term users of hair pills or dick pills are going to discover they're being ripped off and find a cheaper option.\n\nAs you said new customers buy on ease of access, which Hims offers compared to going to an actual doctor, but I would imagine that differentiation will be wiped out in the long term as others such as Amazon take the space more seriously. Maybe it will be an eventual acquisition target, who knows.", "I don't own NVDA. No opinion.", "For fun, I took my current portfolio size / contribution rate  and plugged in 18% annual gains until my retirement. That would imply I will have nearly a quarter of a BILLION dollars in my portfolio.\n\nHot take: I will not be a billionaire in my final years", "You can't disagree with a calculator result. Don't post here anymore if you're this dense.", "Me too this guy is full of sh*t ion like his energy!", ">Who knows what will this AI craze turn into, I wouldn't be surprised if it's a mini repeat of dot.com.\n\nDo I feel as certain about it as market ripping to new ATHs this year?\n\nNo obviously.  I feel extremely confident about SPX and that's why I am primarily VOO.\n\nHowever, I am comfortable making a bet on AI because *the entirety of Silicon Valley is behind it*.  When Brian Chesky, the CEO of ABNB told Nadella during the OpenAI drama, \"The Valley stands behind Sam.\" He might as well have said the Valley stands behind AI.\n\nThere are billions of investment and spend pouring into the space from all the big players plus TONS of money that will flow in from PE, VC, family offices that are blowing up:\n\n[Family offices have tripled since 2019, creating a new gold rush on Wall Street.](https://www.cnbc.com/2024/03/08/family-offices-tripled-creating-a-new-gold-rush-on-wall-street.html)\n\n>Experts say family offices now manage $6 trillion or more, and their ranks are growing.\n\n>The number of family offices in the world has tripled since 2019, setting off a new race among private equity firms, hedge funds and venture capital firms to attract their investments.\n\nThere's no concrete sign at all that demand is satiating or they aren't dominant.  It's picks and shovels and it's in everyone's interest to keep doubling down on AI.  Minimum one year.\n\nOnce there's a sign I will consider revising my thesis.", "It's not the only game in town by a long shot though already competition is fierce. Latest earnings presentation shows off market share progression vs numerous competitors already in the same markets. As for margins, because Hims has a partner pharmacy network and can cut costs combined with ltv/cac I am not terribly concerned at least not yet. Execution has been close to flawless in my eyes", "You don't know how to operate a calculator. It's not something you can just disagree on. It's objective fact. Just plug it into https://www.investor.gov/financial-tools-calculators/calculators/compound-interest-calculator and see for yourself\n\n/u/question900 this goes for you too. This. is. basic. math. there. is. no. room. to. disagree. you. fucking. idiots.", "> However, I am comfortable making a bet on AI because the entirety of Silicon Valley is behind it. \n\nYeah but that's not really a business case. It's not like they don't make mistakes all the times (which is a lot cheaper when rates are low) just like back in 2021 or 2000. Leading up 2021 they throwing money left and right into all kinds of nonsense. A lot of it entirely evaporated and if you started late and didn't cash out in time (of now course Nvidia or even AMD atm are extremely solid picks relative to most \"growth\" companies from back then). \n\nWhile it's a revolutionary technology it's not exactly clear how and when will companies make money from AI yet, just like it was with the internet back in the day. CISCO/Intel/AMD/etc.  were selling \"picks\" and \"shovels\" (and certainly had solid products) that didn't really save them (well long term they did  fine or even great but the people who bought in 1999/2000 were entirely fucked). Of course I really have no clue or a even a strong opinion on what will happen but it wouldn't be extremely surprising if even if \"AI\" becomes  a massive revolutionary success over the next 10-20 years it might not be the best time to invest into Nvidia ATM.\n\nSince we already had almost the same thing happen with internet a few decades ago it's probably worthwhile to be a at least somewhat cautious. Of course specifics and context very extremely different (not it's almost entirely driven by massive tech companies and not pets.com etc. But even if there won't be a massive crash, or even one as bad as after crypto a slowdown for a year or two is not unlikely (less than expected growth, competitors catch up and Nvidia actually has to compete on price etc.) as companies actually slow down to figure out what they can do with all of those fancy GPUs. Of course Nvidia might be worth 2-3x more than now when[IF] that starts happening.\n\n> Once there's a sign I will consider revising my thesis.\n\nNot targeting at you specifically (since I don't really know you and you might actually know what you're talking about) but for most retail investors it's already way too late at that point (especially  considering how volatile the market is these days).\n\ne.g. what would you have done in Nov-Dec 2021? Would you have exited earlier like in September (because some signs were already there)? But you've missed 50% of gains in the next month? \n\nOf course with the benefit of hindsight  the optimal choice was to do nothing and even buy more while Nvidia was crashing. But there weren't really any clears signs that AI will come so fast and hit so hard (and the signs that there were way to hard or notice for most people browsing on r/stocks or most professional investors).", "Maybe you miscalculated", "No ur full of shit n u miscalculated…..\n\nNo one here is a f*ckin idiot stop with the depreciation or my ass is gonna do a spell on ur ass so ur stocks go down and so u can’t get hard. Pussy boi. \n\nIm a white witch dont fuck with me Cache….", "If this is CSCO, which I don't think it is, its 97 not 00.  If it wasn't AI it was something else.  Economy will be booming 2024.  We have more fiscal stimulus 2024 than 2023.  Ample liquidity and loose financial conditions, credit flowing and lending hitting ATHs.  Immigration tailwinds to help keep inflation cool.  Every macro tailwind screams growth.\n\n\nTrillions will flow into the market.  Buybacks, divies, 401k dollars, pension funds, endowments, paychecks.  It's gotta go somewhere.\n\nStocks are an inelastic good with finite supply, extreme scarcity (shrinking from buybacks), and very high demand.", "They will win Nobel Prize for their research:\n\n\n[In Search of the Origins of Financial Fluctuations: The Inelastic Markets Hypothesis by Xavier Gabaix & Ralph S. J. Koijen](https://www.nber.org/papers/w28967)\n\n[The Inelastic Market Hypothesis: A Microstructural Interpretation by Jean-Philippe Bouchaud](https://arxiv.org/abs/2108.00242)\n\nInelastic market hypothesis predicts SPX will continue to roar market higher this year absent a genuine black swan.\n\nCredit event will not be it since Fed 100% won't hike again and they are committed to their new ample liquidity framework.", "Maybe I out to give you a stone cold stunner for saying that.", "That. Is. A. ~*~ hilarious ~*~ response. \n\n> Im a white witch dont fuck with me Cache….\n\nsudo sh -c \"sync; echo 1 > /proc/sys/vm/drop_caches\"", "Cisco Crashed in Feb/March 2000 together with everyone else. \n\n> extreme scarcity (shrinking from buybacks), \n\nThat's not how it often works with tech stocks especially, they do buybacks to control dilutions because of RSUs and options. \n\nBut yeah, I'm not talking about the financial conditions or even the market as whole. That's certainly different in many ways but also mostly or entirely tangential to what I talked about..", "u/tetrakishexahedron to clarify further, until a bigger and better growth story comes along, AI is it.  It's in the interest of all the players, VC, big tech, PE, wall st, to make it work as long as economy is roaring, which it will very much be all of 2024.", "Maybe (thanks, might be worth reading ). I was more interested in prospects for  Nvidia and AI though...", "It doesn't matter, the market as a whole has extreme inflows amd will continue to.\n\nLike I said, who cares about 00 if its 97?", "You agree with me then?  Buy backs makes stocks scarce.", "So you're cashing out by then end of 2024 and/or when you see a better bubble elsewhere? Because that's an entirely different even if still interesting conversation....", "They are very related though.  If not AI, what will power the market?\n\nCSCO didn't collapse until recession was imminent and financial conditions tightened.", "> who cares about 00 if its 97?\n\nI'm not sure what do you mean by that?", "Depends on the company and what proportion of their employer salaries are in stock. \n\nOf course yes they do, that's kind of the definition. But effectively it's the same as if they paid a dividend and you immediately used it to buy shares in the same company (just almost completely tax free), it's not exactly leading to \"extreme scarcity\" whatever that is.", "Not necessarily if conditions keep going this way and stimulative stance of Fed continues.\n\nI'm just saying we are guaranteed to get a good economy at least for this year.", "It's not really different.  Tbf, I am almost entirely VOO with a small position in NVDA.  Plus I am still mega long big tech, AAPL, GOOGL, MSFT, NFLX etc.\n\nHowever, the theme is AI.  That's the growth driver.  Whether it turns out to be real (I think it is) or not doesn't matter for my thesis this year.", "https://i.imgur.com/sOU4PzD.png\n\nu/tetrakishexahedron\n\nEconomy is going to roar forward and AI is the poster boy.  I happen to be optimistic and think it will prove transformative eventually.  Especially once we potentially marry biocomputing and lab grown brains with the firepower of silicon:\n\nhttps://www.science.org/content/article/scientists-fuse-human-brain-cells-electronic-circuits-and-make-it-think\n\nLab grown brains can recognize basic speech, perform simple calculations and play pong.\n\nBut yea that could be very far away.  My thesis is this year.", "> financial conditions tightened.\n\nYes the Fed cut rates from 6.0-6.5% to almost 1% at the same time. And massive pivot didn't save anyone that time.\n\nI find it quite fascinating that the entire dot.com happened despite very high rates by our standards (4.5%-6.5%)", "> Cisco Crashed in Feb/March 2000 together with everyone else.\n\nSorry I am not sure how much more clear to make it?  How is what happens in 2000 relevant if I am correct that it is closer to 97 in conditions?  I'm not saying I necessarily  believe that btw.  Just saying IF a crash is coming, it is much closer to 97 than 00.", "It is.  Because trillions flow into the market constantly and it has to find a home.\n\nShare count is decreasing overall but net inflows don't stop.  It's a highly desired good with inelastic demand but finite supply.\n\nEspecially if rate cuts come the flood will be immense.  However, it will grind up steadily and continue to exhibit positive drift regardless.  Just not as fast.", "The difference is the framework of the Fed is entirely different.  You know that the entire way Fed operates is a 100% contrast with then right?", "I'm not trying to convince you that a crash is coming. And yeah we might be closer to 1997 than to 2000 and there might be a few more years of exponential growth left.\n\nBut drawing such low level parallels between very different periods seems hardly useful.\n\nThe exponential growth really accelerated  after the Fed started hiking in June 1999 from 4.75% to 6.5% by next June. The fastest and most insane growth happened during that year as the rates were going up continuously..\n\nThe market crashed almost as soon as they stopped hiking (obviously there were other things happenings) but in that wat it's the complete inverse of the situation today.", "Maybe a better description for bitcoin than the stock market.", "Maybe not entirely, but certainly partially. Which was kind of my point", ">The market crashed almost as soon as they stopped hiking\n\nThis is where you are wrong.  The market crashed once companies started to default and credit *tightened*.\n\nHas less to do with the exact timing of hikes and more that it was enough to stop lending.\n\nThe key difference is that lending is loose and still hitting ATHs.  Credit spreads are plummeting:\n\nhttps://fred.stlouisfed.org/graph/fredgraph.png?g=1ianC", "Nope.  Actually BTC is very mildly inflationary in supply.  Stocks are not.", "https://www.federalreserve.gov/releases/h8/20240308/\n\nu/tetrakishexahedron lending hitting ATHs still.\n\nEven the unreliable soft survey data is coming around:\n\nhttps://fred.stlouisfed.org/graph/fredgraph.png?g=1iaoG", "Stocks on the whole are certainly inflationary unless you're only looking at individual companies. Even if you look at something like Google:\nhttps://www.macrotrends.net/stocks/charts/GOOGL/alphabet/shares-outstanding\n\nThey didn't start buying more stocks than they issues until ~2018. \n\nAnd they the you many of the \"startups\" that IPOed ~2020 who still keep printing like crazy.", "Huh?\n\nBut you're missing the point the S&P 500 is buying back mostly.  That's where the flows are going to go.\n\nAnd GOOGL is decreasing share count consistently.", "Sure, maybe... I'm really not sure why you even dragging me into this argument? It has almost nothing at all to do with the original topic...", "It  totally does!  Lol.\n\nYou just for some reason refuse to see they are completely related.  That's fine by me though.\n\nIf economy is strong (it is) and continues to be (it will) AI will be the story.  If I am wrong about the economy or a genuine non-credit event black swan comes then I am wrong about AI.  \n\nBut otherwise just watch AI will keep printing."]}