{"url": "https://www.reddit.com/r/IndianStockMarket/comments/18mxbka/suggest_some_stocks_for_2024_which_i_dont_have_to/", "post_title": "suggest_some_stocks_for_2024_which_i_dont_have_to", "post_content": "I've spent lot of time studying the market, companies stocks in early 2023. \nTook about 12% profit so far and there are few small shares that are in negative right now but my other present positive shares will compromise for it. \n\nNow for 2024, and I'm not updated with market or companies news. I don't have that much time or interest to spent that much time in these months. Because there are way too many that were on my list and I can't keep track of all the companies. \n\nCan you guys suggest some good stock which I don't have to bother for about a year which can give me at least 15% profit? And of course it'd be good if it's more than that\nAnd I can do little of my research on them as well. \n\nAnd Mutual Funds or Nifty 50, I never studied them much so if you guys are gonna suggest those. Then do let me know how much average profit they will give and how long I have to wait as well.\n\nAnd edit: some people mentioned there's never buy and forget. \nI do understand that. What I meant is I don't want to check on market few times every single day, I'll probably check twice a week or something like that", "post_comments": ["\nIf you haven't already, please add your own analysis/opinions to your post to save it from being removed for being a Low Effort post.\n\nPlease DO NOT ask for BUY/SELL advice without sharing your own opinions with reasons first. Such posts will be removed.\n\nPlease also refer to the [FAQ](https://www.reddit.com/r/IndianStockMarket/comments/17bcg2a/frequently asked questions_post_your_common/) where most common questions have already been answered.  \n\nSubscribe to our [weekly newsletter](https://pennyleaks.substack.com/) and join our [Discord group](https://discord.gg/8QF4dqPHuw)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianStockMarket) if you have any questions or concerns.*", "Brittania, TITAN, UJJIVAN . Remind me after dec 15 2024.", "If you want to invest like that, buy an index fund. its literally every stock on the index", "IRFC, TATA POWER", "There is No 'Buy n Forget' stock...be it for months or even a year.\n\nIf you don't have time for individual stock picking why not simply invest in NIFTY 50 and get average returns ?", "Ruk Jaa Bhai...market abhi aur girega", "PSU stocks me bullish hu personally except banks.. but try to buy in installments.. ek sath loge to fear aaega", "If 10% is all you are expecting, don't  do direct investing. I strongly disbelieve the \"buy and forget\" strategy that is overglorified  in the markets these days. \n\nIn my opinion, this will be a strong year for the stock markets given the run up to the elections and Fed cutting the interest rates at the same time and record SIP inflows into the market. \n\nYou could invest in chosen NIFTY 50 stocks, they're likely to easily give you 10% profits in the coming year. Could be IT stock like INFY or TCS, could be private banks like HDFC, ICICI or could be could be Pharma stocks like Cipla and Sun Pharma.", "In stockmarket, you\n\n1. be an active investor/trader who actively monitors portfolio, here skill helps you make returns\n2. a noob who doesn't know much about stock market, but SIPs regularly in index/MF, here consistency will make returns\n\nbe 1 or 2, don't be in between\n\nThere is no stock which you can buy and forget for an year, best of best companies goes though business cycles\n\ncoming to MF, you just keep on buying at regular intervals, do not stop. Over the longrun(5-10yes) it may give 10-15% CAGR", "IPCA labs.. but it is mid cap so can be risky.. then I would say electronics boom is coming.. so tata tech is gold for me.. but again do your analysis on these two.. I am very optimistic but I still consider them moderate risk for investment..", "IRFC, IRB infra , Indiabulls real estate all are under ₹100", "Tata Motors and Power. ITC. HDFC.", "Reliance, PVR and BHEL", "The entire IT sector (large caps) should do 12-15% next year given the poor base effect from this year", "Bharat Dynamics", "Go for large cap stocks, you know your money is safe here and even if there is a minor correction next year.\nYou don't have to worry as these stocks have rock solid foundations and will recover in the foreseeable future\n\nDiversity is the key here - \nInvest in sectors such as \nRailway, Sustainable energy, Road infrastructure, Automobile, Defence\n\nInvest wisely", "There are many buy and forget shares, you need to have good research support throughout your financial journey. Ping me if you are really interested in making wealth 95 999 277 46", "IMO, 2024 is really going to be a roller coaster ride for all investors. The so long speculation of all time high market crash will come face to face with the elections and rate cuts bull run. Its going to be the most volatile year ever.", "keep an eye on Swadeshi Polytex, SJVNN, Suzlon and Seacoast", "Ircon, zensartech, psu banks, starcement, Tdpowersys, hscl, aparind...\nTrade at own risk", "Keep 10k in bitcoin", "netweb technologies\nKaynes\nHindustan foods\nLatent view analytics", "I'd like to ask if there's an alternative way to generate income other than our Indian stock market.", "Buy thejo engineering or skipper", "Why not just invest in index fund in sip mode.", "HRITICK : HDFC Bank, Reliance, ITC, TCS, Infosys, Coal India, Kotak Majumdar Bank. \n\nApart from this Tata Motors, Cipla, Sun Pharma, Nestle ( After Bonus and correction ), Latentview. \n\nNotes : \nI do not believe in buy and forget. \n\nThis is not a stock recommendation, just suggestions", "PPL\nNtpc\nPowergrid\nSwan energy\nLt foods", "If you are serious about Investing, buy index funds and leave it for long-term. You will thank yourself later\n\nhttps://www.reddit.com/u/Iamthefalcontrader/s/SECegfQyFs\n\nCheck out this post", "!RemindMe 1 year", "!RemindMe 1 year", "!Remind me 6 months", "I have heard this a couple of times, and do you guys mean to buy Nifty's ETF?", "Irfc? Railways? I just did in IRED yesterday for short term", "Not completely ' buy and forget' I can check sometimes once a week or 10 days. I just, don't wanna do every day\n\nIt's just, what I meant is I don't have as much time as I did in 2023 to just research on different sectors and their companies. I did for like a least 3 days worth hours which would be about 72hrs. I can't spend that much time now.\n\nYes, I'm also thinking of that, NIFTY 50 or 100.", "😭", "I am thinking to invest in bandhan bank", "Okay, let me edit my post a bit. I'll make it 15. Because I think I'm done with 10 😅\n\nAnd of course buy and forget completely is not gonna be good. We have to check up once in awhile at least, every week minimum.", "My amount is not big, it's all for some experience. So I think it won't do much for even 5yrs investment \nThat's why I said 1yrs.\n\nI'll probably go for Index", "I've invested in Tata motors around 400 and sold at 600", "Stay away from all these punter stocks", "Business, invest as partner", "!Remind me in 1 year", "I will be messaging you in 1 year on [**2024-12-20 18:44:35 UTC**](http://www.wolframalpha.com/input/?i=2024-12-20%2018:44:35%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/IndianStockMarket/comments/18mxbka/suggest_some_stocks_for_2024_which_i_dont_have_to/ke7qok6/?context=3)\n\n[**12 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FIndianStockMarket%2Fcomments%2F18mxbka%2Fsuggest_some_stocks_for_2024_which_i_dont_have_to%2Fke7qok6%2F%5D%0A%0ARemindMe%21%202024-12-20%2018%3A44%3A35%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2018mxbka)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "Yeah, either niftybees or any nifty50 mf", "https://www.reddit.com/u/Iamthefalcontrader/s/SECegfQyFs\nHave a look at this, you will understand!", "Yes, not necessarily ETFs, there are mutual funds as well.", "The finance market is growing and that is the reason it's a good time to invest in this stock. For most other stocks are too expensive. It's not a bad choice. The company has great scope too. Railways stocks in general have a good future, India would have to work on infrastructure not matter what and these companies will grow and so will your investments.", "Yes . I am holding 2900 @ 25 for long term", "I'll tell you , you are better at making gains in NIFTY than do individual stock picking this way. \n\nYour once in a week peek-a-boo of individual stock won't outweigh or even beat the index.#Nifty50", "What is your logic in going for it?", "Not an expert but you can if you want to, just make sure to exit if it stays below 210 for a day or two.. fall below it can be brutal", "I had it in my watch list too", "Now it's 1000+ 😁", "Wait why is SJVN a punter stock? XD", "bro I am just sharing my opinion and tbh swadeshi polytex and sjvnn are one of my favorite. They have good fundamentals. could u pls tell why not to invest?", "So you suggesting buying Nifty ETF?", "Growing revenue YoY, low PE, growing eps. \nPlus it has good potential to grow, as it is the most recent institution which was granted full license by RBI, but it has not yet seen its full growth.", "Yeah.....😔", "SJVN is better than others, however no revenue and profit growth over the past 5 years. It's flat but huge rally seen without any fundamentals change. Suzlon is big punter stock btw", "Yeah or invest in any NIFTY50 Mutual fund.", "I’m also interested in Bandhan bank. Everything goes well if there is no change of top management", "The huge rally is because of the growing demand for power/ electricity & due to the advent of renewable energy hype since they dabble in hydro power generation as well as signing new solar contracts. I would stay away from Suzlon since they have diluted their equity a lot in order to keep their company afloat.  Even with a 10000 cr profit they’ll have an EPS of 10₹ which likely wont ever happen.", "yes i agree that sales are increasing at a slow rate but the demand for renewable energy is increasing rapidly. I think 2024 might be a breakout year for SJVN."]}