{"url": "https://www.reddit.com/r/IndianStockMarket/comments/17gq3y5/what_stocks_are_you_buying_in_this_dip/", "post_title": "what_stocks_are_you_buying_in_this_dip", "post_content": "My picks are HDFC Bank / pricol / Mazdock / kei / ujjivan FS / Usha martin / lemon tree / Equitas SFB / Gokaldas Exports / VBL / Westlife \n\n\nHdfc bank - it's a matter of a few quarters before the stock justifies the merger in it's results and stock price goes up \n\nPricol - attractive auto ancillary business which is into automation\n\nKei - wires and pipes are required in all capex pans of industries \n\nLemon tree / VBL / Westlife (qsr) - Consumption businesses are bound to do good and these have good fundamentals \n\nUjjivan / equitas - microfinance doing good atm \n\nGokaldas - textile industry is picking up in India and this one has good Fundamentals\n\n\n\n\nAll these have strong fundamentals and are at attractive valuations right now", "post_comments": ["\nIf you haven't already, please add your own analysis/opinions to your post to save it from being removed for being a Low Effort post.\n\nPlease also refer to the [FAQ](https://www.reddit.com/r/IndianStockMarket/comments/17bcg2a/frequently asked questions_post_your_common/) where most common questions have already been answered.  \n\nSubscribe to our [weekly newsletter](https://pennyleaks.substack.com/) and join our [Discord group](https://discord.gg/8QF4dqPHuw)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianStockMarket) if you have any questions or concerns.*", "The dip is buying me", "* Varun Beverages Limited\n* Tips Industries Limited \n* Hindustan Aeronautics Limited\n* Mishra Dhatu Nigam Limited\n* Cupid Limited (not sure, still researching)", "Waiting for hdfc to hit 1400", "ITC to the moon baby", "Larsen and toubro\nFederal bank \nItc", "Don't buy Mazdock, you'll be stuck for a long time", "Buy in staggered way please as dip could be more than all of our expectations", "HDFC, Reliance, INFY, HDFC Life among other banks", "Sab abhi buy Karo aur barbad ho jao.. phir mai buy karunga.", "J&K Bank, IDFC First, Tata Motors", "PIIND, DEEPAKNTR, HDFCBANK, PIDILITE, ASIANPAINT", "My Holdings today\n\n1. ITC⬆️—-2. Dynamatic Tech⬇️—-3. Zensar tech⬆️—-4. CreditAccess Grameen⬆️—-5. Paras Defence⬇️—- 6. Mazagon Dock Ship⬆️—- 7. AngeOne⬆️\n\nThose two also recovered pretty okay", "Why not irfc", "Is it ok buy Indian oil Corporation", "Trent, idfc first bank", "IRCTC also took a big dip", "Op bhai not buying RIL, TCS etc.?", "Vbl", "Mazdock went up quite high already so consider it a volatile share.\n\nBetter buy Garden Reach or Cochin Shipyard (same sector)", "Nhpc", "Averaging my own portfolio. These are the stocks I have conviction, continuing those.", "Rajesh Exports..today 6% up... be carefull, it may be manipulation", "INDHOTEL\nRECLTD\nSHRIRAMFIN\nRELIANCE", "i have a doubt pricol has high public holding my assumption is that even if the price just jumps 30% from currrent levels they would sell right?", "Man.. must say.. impressive 👏👏👏", "Never pick falling knife!!!", "VBL", "HDFC, Small investments added in Indigo and IDFC first bank.", "Bought HDFC 30 NOV 1450 CE, Sahi price meh mil gaaya, kal aur kharidenge..HDFC BANK is in oversold Territory aur lag raha he sharp recovery de dega iss month peh.", "Nifty is still overweight by about 30%", "same stocks I am buying in SIP regularly, no plan to change it", "Follow", "HDFC bank 2000 soon in about 3-4 months", "You got all the good ones", "Rich guy", "Rajesh exports saved me Today 😂, \n\nI didn't have the courage to buy at 413 today and now it's at 437 😂", "Beml ,jp power, Reliance Power,BLS \n\nExide batteries", "itc ioc", "Federal Bank, South Indian bank, dr reddy, Amara raja, Exide, idfc, Tata motors dvr", "HAL\nBEL\nIRCTC\nIRCON\nBSE\nMCX\nCDSL", "For textile my pick is kpr mill.", "i bought HCC, Vip clothing. Now will buy Prakash Ind tomorrow", "What about IRFC ?", "dip is yet to come", "OP... I am with you on Lemon Tree 👍.", "Im betting big on axis, HDFC and bank of Karnataka second group of stocks Andhra paper, adani green, Tata motors, Zydus Life sciences", "What's the best price to buy HDFC and reliance?", "increasing stakes in Pricol, ACE, Paytm, KPI green", "Looking at HDFC, Prestige grp, HAL, IRFC, RIL for now", "Upvote for gokaldas", "Midcaps and smallcaps are too good to miss imo just some more correction left there but dont miss them", "Max Healthcare\n\nLinde India\n\nL&T\n\nJTEKT\n\nFoseco India\n\nWestlife Foods\n\nShanthi Gears", "Nothing new. I’ve got 4-5 stocks and I plan on just adding to them.\nRIL, HDFC, M&M and HAL. \nTata coffee too, but that’s a different play and correction has no impact on it.", "SSWL, Fiem industries, SRF, Guj fluro, hdfc bank, icici bank, EPL", "HDFC Bank  \nInfosys  \nReliance  \nWipro  \nTata power  \nDeepak Nitrate  \nTanla Platforms  \nCAMS  \nCDSL", "1.NIFTY BEES\n2.ITC", "I suggest buying any **Tech fund** on this dip. [Graph](https://imgur.com/kl3lrKR)", "Bought everything when nifty hit 20k and now i don’t have money 😂", "EV battery stocks", "This is hilarious 🤣🤣 OP did not do his homework", "lmao", "Why tips and not saregama?", "Bro, how to do research. New to markets and eager to learn. Would appreciate any guidance", "DUUUUUDE. I added these to my watchlist to see how they do, and in today's gap up, \n\nVBL - 5.77%\nTIPSINDLTD - 0.25%\nHAL - 2.04%\nMIDHANI - 3.2%\n\nBut most importantly,\n\nCUPID shot up by 15%!!!", "Why hal and not mazdock?", "HAL @?", "Bhag jayega bhai 1450 ke levels se wapas. Add krte reh in small quantities", "Uska sep 2022 ka 1421 ka bahut achha support nai hai?\n\nP.s I'm new in market", "Buying at current mkt price or waiting further to fall?", "Mazdock jumped 8% today btw", "insurance cos are shjt", "Idfc first or idfc?", "Meri bhavnayen", "bro running in Safe Mode with Anti Virus on a windows Vista.", "Just brought 300 shares at Rs.69.4 ;)", "I’m targeting around 70", "I'm also eyeing on IDFC First.", "Nopes!! Never again!! \n\nI have a rule - to never invest in Govt stocks. But yes, good ones like ship manufacturer / defence I can make an exception.\n\nI had irctc average 720. Sold it at 650/- :(", "Names?", "\\-ve beta hai Market upar yeh niche , Market niche yeh upar.  \n\n\nFaltu co. hai don't even waste you're time.", "It was manipulation when it was going down too!", "Why?", "*catch\n\nYou can pick it, if it's fallen. Not while it's falling.", "Brother how many you picked for HDFC ? I mean what's the quantity", "My hdfc average is 1519/- \n\nLet's see if it dips a bit further", "Where do you get this data from ?", "What are those?", "which are those?", "!Remind me in 3 months", "And I had bought at 537 . That too by mistake bought 10 times the amount I wanted to invest in it. It’s killing me.", "https://preview.redd.it/mkeeesgehiwb1.jpeg?width=750&format=pjpg&auto=webp&s=fc465ca0e0500e1096024dcb6a01437dffaef448\n\nI sort of called it yesterday on the sub.", "anand srinivasan?", "Why? Why not ITC, or Indian Hotels chain", "You should buy it now with 1/3rd of ur money so u don't miss the bottom of this company, if it dip again which is hard because unless some big negative updates about war or 10 US yield news comes, there is nothing fundamentally bad for this company to go down. But if it does go down, you could average down twice more.", "Idk if it is a good entry time. I had it and I sold it and have been looking for an entry point ever since. But kpr mills looks stronger in fundamentals", "I will get pricol, lemon tree, gokaldas, Westlife and vbl for sure. \n\nWanted to get bector foods too but it ran up today", "Westlife Foodworld - I am invested too but the results were not good and the stock went down today", "TIL is a now a music only business, however, SIL shelters Caravaan, Yoodlee Films, etc,. along with its legacy business. Also, there has been inventory pile up in case of Caravaan.", "1. I first look out for macroeconomic tends in the industry, like cyclical business of not, government subsidies and incentives, etc,.\n\n2. Then a couple of industry specific articles or reports by KPMG, FICCI, SIPRI, etc,. to understand the nature of industry and about significant players, competitive landscape (sometimes, I also refer to JioMags).\n\n3. For Cupid Limited, I'm planning to watch a few documentaries from Brazil and Africa to get better understanding of the ground reality.\n\n4. I read the transcript of conference calls and see whether the same has been reflected in subsequent quarters or not.\n\n5. Then I look at the financials and do some ratio analysis, like inventory turnover, RoE, RoCE, P/E, free cash flow, volume growth, etc,.\n\n6. Sometimes, I skim through YouTube to listen to  interviews of the management or any expert of that domain, etc,.", "https://www.reddit.com/r/IndianStockMarket/s/0hCldPxW3C\n\nDo checkout for resources to learn more about the markets.", "Yeah, but I wish all of them crash like 40%-50% so I can accumulate more and then they can rise![gif](emote|free_emotes_pack|sunglasses).", "Limited cash, so very choosy. I do have Mazagon Dock Shipbuilders Limited (average cost \\~₹800 ish), so not adding that.", "Socha hai kal karunga bhai. Let’s see", "I guess you should wait US ka market ghir raha hai,  \nKal week expiry hai,  \nAur ghirge HDFC aur pura market.", "Average out. Don't go all in though. Slow but steady, as no one can predict the bottom.", "It's already on the lower side of the spectrum.", "Short term gratification, long term pain in the ass", "I bought idfc over firstbank cuz of the arbitrage", "i am doing positional trading.. hehe", "Same quantity here but at 67.1", "I am waiting for 55-57 level I believe itna ghire ga.", "What's the news on the merger? Need to get idfc first right?", "I’m just wondering why do you sell stocks? Why can’t you wait for few more years? I’ve the opposite stance of yours on govt stocks. I got IRFC in IPO and for few first years, it was at 20-30₹. Now see the stock price.", "Biocon, Wipro, Titan, JK Paper\n\n\nAll bluechip other than JK Paper", "If it stabalizes above 525 - 550 range , we can say a trend reversal.\nI have been studying this stock since long time, and their expansion into EV Battery can make significant improvement in Margin", "Bcoz, Firstly..\n\nI love the stock selection; all are good strong companies with good track-record in their respective sectors\n\nSecondly, due to recent sell-off or similar reasons, almost each has corrected a bit so straight at least 10%-15% upside scope to nearest high.\n\nThirdly, going by some of these companies previous performance, quite possible they pass even the last milestone, too !", "Finolosopher", "Sab ke Sab Quote de rahe hai, agar Quote se portfolio green hota sabse ameer ise subreddit ke member hote.  \n\n\nAccumulate at dip, no one knows how much further market will fall. ( market may rise or fall further) find good stock Invest as a SIP.", "10 yesterday, 20 today, planning to add more if it goes down further", "Bhai HDFC ka kya hua.", "Why not buy more to get ur average below ₹1500... If I had not bought the call Options of HDFC, i would buy all stocks of bank nifty as the fundamental and results were good, just external factor having panic selling in the sector and bought a good opportunity to buy the dip...", "He measured its BMI.", "I will be messaging you in 3 months on [**2024-01-26 10:27:32 UTC**](http://www.wolframalpha.com/input/?i=2024-01-26%2010:27:32%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/IndianStockMarket/comments/17gq3y5/what_stocks_are_you_buying_in_this_dip/k6ipkca/?context=3)\n\n[**7 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FIndianStockMarket%2Fcomments%2F17gq3y5%2Fwhat_stocks_are_you_buying_in_this_dip%2Fk6ipkca%2F%5D%0A%0ARemindMe%21%202024-01-26%2010%3A27%3A32%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2017gq3y5)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "My average is 491,  bought for a target of 1000...", "Originally i thought 500 is the support for the stock.  It broke all the support. \nSo it's totally the luck factor. And i believe patience is the biggest factor.", "Correction - mine was at 508", "Usually its reversal point as per history was around 500, this is the first time it tested 400 levels.", "Yes", "Hehe.... Its your choice I find risk reward ratio better in Lemon Tree... I bought IH at Rs 99/- during covid and sold out at 250...now it looks expensive to me. ITC is not a 100% hotel stock... everyone knows it. I have ITC as well.", "I think 780s would be a good entry price once it taps that out should target 930s in no time", "True. Fortunately I am invested since mid 2022 so still in profits", "BRO.......\n\nI just placed order at 315 Tips rocks baki sab flop.  \nTune kitne mai liya?\n\n&#x200B;\n\nI also bought Angel one.", "Thank you bhai for being so elaborate. This really helps.", "Honestly I have a feeling they will. This gapup provided a good opportunity to people who want to sell. I'm expecting the market to fall tomorrow by 2-3%", "But mazadock is good no??", "Great decision👌\nWhat's you target and stop loss by the way!?", "Possible if market falls more", "I bought idfc cuz of arbitrage..what do you guys think?", "Govt co. usually never get a premium valuation because they are Govt. co.", "Agree with you, EV can be a game changer for them. Also, there’s not much downside risk at this point for the stock because it is trading below its book value.\n\nI’m holding the stock and I have conviction that it eventually will give good returns..", "Thanks .. \n\nYes, had to do considerable hard work for the selection\n\nBut I couldn't buy any .. waiting for another dip which I think will come shortly in the individual stocks ..will get them then", "***Chill dude its okay*** if he don't want to pick a fallen knife *have some belief in him*", "Lololol", "Why has this happened any clue?", "Won't reach 780 again .. I was hoping 800 it will reach today but no :(", "I've been holding it since it was ₹220ish (before split). 14X in around 2 years. I had originally brought around 10 shares. Kept adding on dips on 2-3 occasions.", "You mean Monday? Fingers crossed. Markets should fall, I'm praying for it.", "Yeah, it is a fantastic company. It also has a significant investment in Goa Shipyard Limited (another amazing company). I've bought it at ₹800ish this year and already in profit. I have limited cash, so would prefer HAL as it is an aligned business. One makes aircraft carriers the other aircrafts.", "75-77, Don't want to hold much longer. What about you", "Can i add more", "Just look at RVNL, IRFC. I mean these were horses that no one thought would make a run and just look at their charts rn. Even IRCTC, albeit I will say the best time for that was to buy it during the covid dip. Like it’s basically a monopoly. Why not buy it if it’s available for a good price?", "Yeah, I am bullish on it and did Bulk buying and got an average of 488..\n\nWill sell above 900-1000 range in February,If EV Plant Updates got started to release, I will hold them, otherwise its just the same cycle every year", "All these are part of my list too (have had evaluated myself over time) so din't have to take more time in validating ur selection as 👌👌🤟🤟👍👍.", "Operator driven stock.", "Tapped out 780 today : )\nYou can add it in trenches, add your first lot here, if the markets correct more from here, which is quite likely then it may even touch 660-700 and that will be the price to hold it for longer term then. Goodluck", "What do you think would be a good price to buy at now.", "Idk dude, if Nifty 50 breaches 18800 next week then I could see it falling to 17000.", "Nice nice!", "Earlier brought it at 78 when the breakout happened unfortunately it failed due to all this war n stuff gave me almost 11% loss\nSo probably gonna try to recover that so yeah kinda same targets at ours + ofc will decide depending on the behaviour of the stock and Nifty", "The problem with IRCTC is that of excessive government interference. A change in rule (like convenience fee) will ruin the business's economics.", "488 is great actually.. my average is 511 and I can’t buy anymore because it has hit max allocation as per my portfolio", "Thanks. Yes. I have been following it closely.", "I feel ₹290-₹320 would be a deal. If available below ₹290 like ₹270 or even ₹250, I consider it to be a jackpot.", "Great. Did you purchase any other stock today? I also purchased Titagarh.", "Yes, Wanted to even add more (already 50% in) at 420, but missed the opportunity. Now I am just holding with patience", "930 done today, hope you made some my man !!", "Nah wasn't actually in a mood to buy anything until the index shows any kind of reversal but just saw huge buying in IRFC which was already in my watchlist + doji \nDidn't thought must just put a sl below the doji low and went it Haha", "Yes dude"]}