{"url": "https://www.reddit.com/r/IndianStockMarket/comments/15hvvgu/why_you_should_never_trust_analysts_when_making/", "post_title": "why_you_should_never_trust_analysts_when_making", "post_content": "I remember when a  couple of years ago, i was looking at ITC as an investment opportunity. I had stayed away from the firm all these years because i didnt want to get into the cigarettes business. But i found that there was untapped value in ITC's FMCG, agri, IT and paperboard business. I was also aware that the hotel industry was keeping ITC's value below the intrinsic value. I finally decided that i would take a long position on this company when the share price was around 200 and PE just below 20.\n\nAt the time, analysts were split in their prospects for ITC with around 50% of them having a buy target at around 270-300 and remaining either had a hold or sell call.\n\nThen few years passed and now every analyst wants you to invest in ITC. The new target is around Rs 500-560. What changed in the last two years that didn't happen in the previous years? The stock price went up. Its easy to predict rains when its cloudy. What most analysts do is follow market trends. They dont have an independent view point on stocks which is why you should never take investment advise from anyone and make your own judgements based on numbers.", "post_comments": ["Subscribe to our [weekly newsletter](https://pennyleaks.substack.com/) and join our [Discord group](https://discord.gg/8QF4dqPHuw)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianStockMarket) if you have any questions or concerns.*", "https://preview.redd.it/g8xcpnsqr2gb1.png?width=1080&format=pjpg&auto=webp&s=dd0dc20131b286db46321469ad9939217c3cdf88\n\nI made this tshirt on Feb 2022. I used to buy 500 shares of ITC every year and in 2022 at that point my avg was 180 and held 5500 shares.", "For the stocks which I have been tracking, I have normally seen the reverse of what analysts predict. The were multiple sell calls on MRF when it touched 93k a few months back.\n\nI get really anxious when there is a buy call on any of the stocks I hold ![gif](emote|free_emotes_pack|money_face)", "I operate with a simple principle that **Nobody knows nothing.** This is not based on arrogance that \"I know everything\" but rather most people are wrong most of the times in market.\n\nI would rather use sites like Trendlyne and take action based on stock ratings than read brokerage reports. Atleast these sites use consistent and objective rules to come up with ratings rather than new thesis conjured out of thin air. I still remember brokerage houses introducing new valuation metrics to value loss making startups.", "I have seen such an example while I was investing a few years ago.\n\nAs a part of my portfolio, I had started investing in Welspun India many years ago when the price was around 90 (before that egyptian cotton quality fiasco). Then the price fell less than 50, but I hung on. I kept averaging it and it slowly inched towards 90 again. Then 2020 happend and the price went down to 30. I still kept averaging whenever I had surplua funds. In 2021 the price soared to 140. And that was when one day I saw analyst on TV discussing the good aspects of welspun india and how it can become a multibagger.\n\nCut to 2022 and the price again came down. I sold my holdings at 120 because I had to cover an obligation. I often think of people who bought at 140 after watching that analyst.", "Analyst reports have short term vision. They mostly look at QoQ results. Not much value should be given to them if one is long term fundamental investor. \n\nOr sometimes they have an ulterior motives. I have seen them giving a sell call on fundamentally very good companies inorder to trigger a panic sell from the hands of retailers so they could accumulate more at lower prices.", "Hume kya humpe to capital hi  na hai 😜", "Agree bro. I was holding Tata motors at 180. But then I watched a video by Mukul Agarwal, as per him it was a useless stock. So I sold it, and you can see where it is today. 😕", "I'm holdings Castrol from 2022 at 107 ...is it good to hold for small time", "This is why I sometimes do the opposite in case of buying a stock (else I buy with my own view).\n\n11-05-23, ICICI Direct made e sell call on Lupin. So I Bought it.\n\nBut I will sell if anything happens in the business or company, not because some analyst gives a buy call.", "Looking for liquid etf of High liquidity.....3 name found Nippon,dsp,Icici.  Where to park money for short term", "Probably they were engineering the market to suit their own investment which necessitates that they provide the opposite advise to the public. I wouldn't be surprised that at bare minimum there were kick backs involved for all their free investment advise.", "On this very sub, people were proudly flouting their portfolio 2 years back\n\n\n\nThose people were saying \n\n\"Patience pays off, time in market blaha blah\"\n\n\n\nThose were same people were given Newtonian truth to buy IT stocks, telling that IT has been most rewarding to them, and It will be IT altogether.\n\n\n\n\nWhen IT was doing good, everyone wanted everyone else to buy IT.\n\n\nNot just analysts,  if analysts tell today, to Sell ITC, all the stories will be  used to lower the self esteem and arguments of the analysts.", "True investors hold based on the performance of the company and are unshaken by popular trends. Good job.", "Good point. It's better to buy when analysts are not optimistic about the stock", "Analysts often give buy calls when the stock as already made a good run.", "Also, if the information from these \"analysts\" are available for free, then obviously it's not there to help you make money. Good deep dived valuation and research metrics won't be available for general free public. How would sell side companies make money if they give it to you for free.", "Most analysts have no clue what the future holds.", "Buy such stocks in large Quantities and intraday or sell it within max 2 days"]}