{"url": "https://www.reddit.com/r/IndianStockMarket/comments/198yotf/hdfc_bank_this_is_why_you_should_hold_or_gain/", "post_title": "hdfc_bank_this_is_why_you_should_hold_or_gain", "post_content": "Hi Guys, \n\n&#x200B;\n\nDisclaimers : \n\n1. I will not go into very detailed tech views on this for mostly understanding of the common people here. The graph is pretty much not the correct representation as it is not a candle or trend graphs but pretty much does the work that I want to explain here. \n\n&#x200B;\n\nAnalysis : \n\n&#x200B;\n\n1. Stock is consolidating at the same avg level for last 3 years now, to be specific from Feb 2023. It has not seen a rally at all even in this Bull market. This happened due to various reasons. Like merger, opening branches rapidly etc. The company is really investing in future with it's huge Cap. ( Refer to the price chart ) \n2. The company is way below it's median PE zone. For a company of this stature it is very rare in this bull market. \n3. Though their Net profit margin is kinda not growing due to merger recently and companies investing in opening newer branches every year, the revenue is at ATH. HDFC opens 650-700 branches each year which is same as maybe total no of branches for many fairly big banks. \n4. Company is sitting on huge revenue and net profit currently. The Cash in flow is also quite big in positive numbers. The financials look pretty strong. There are few issues of course like Contingent liabilities of Rs.18,22,393 Cr, Earnings include an other income of Rs.88,999 Cr which doesn't have a clear breakdown. \n5. FIIs are heavily invested in this stock. So Fed rate cuts in coming quarters is gonna be very very profitable for this stock hopefully. One thing here that the stock of this company can be manipulated by FIIs and DIIs heavily. \n6. The latest quarterly report is also not too bad. \n\n&#x200B;\n\nFuture : \n\n1. I am not literally sure about the target price but I am sure for long term holding it is quite a good Large Cap stock. \n2. It can fall further. I have mentioned the support levels. It has already fell below two levels, I personally took newer positions in both the levels. Next level is also only 3.5-4 % around away. But once it holds one of the levels, it will stabilize. \n\n&#x200B;\n\nSo the moral of the story is, HDFC are going through a lot of structural changes and strategy changes. The fundamentals are strong though. The stock is underbought, consolidation for long term. I am quite sure that this stock will rally in a long term. \n\n&#x200B;\n\nLet me know of your views. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;", "post_comments": ["\nIf you haven't already, please add your own analysis/opinions to your post to save it from being removed for being a Low Effort post.\n\nPlease DO NOT ask for BUY/SELL advice without sharing your own opinions with reasons first. Such posts will be removed.\n\nPlease also refer to the [FAQ](https://www.reddit.com/r/IndianStockMarket/comments/17bcg2a/frequently asked questions_post_your_common/) where most common questions have already been answered.  \n\nSubscribe to our [weekly newsletter](https://pennyleaks.substack.com/) and join our [Discord group](https://discord.gg/8QF4dqPHuw)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianStockMarket) if you have any questions or concerns.*", "Kitna laga hai bhai Tera isme", "Adr down 7% . Even below your 3-4% support levels . Where does it go now ?", "bhai yeh mai 2 saal se sun raha hun", "China is not able to stabilize it's economy, so US is not getting it's goods on time. So USA cannot cut the fedrate as it increase in the inflation with supply being less from China. Hence FPIs are pulling out money as US bond markets are attractive investment. More FIIs and FPIs are going pull money out, only retail and DIIs can save falling market", "Hdfc is the next ITC. ITC was sideways for the longest time till it took off.", "All this analysis is useless as in the end EPS is not growing. For future this type of talk looks fascinating but there is real pain in the banking sector as provisions are increasing, CASA deposits r not increasing. This year also HDFC opened a record high branches and it all resulted in no growth.", "I've added some few months ago, was in green till today... Today it fell into red.\n\nFor long term I am super bullish about it(similar reason as you mentioned and their balance sheet).\n\nI am not going to look at it for atleast 5 years.\n\nI am expecting atleast 5 bagger on the very optimistic side and atleast double in worst scenario in that time frame.\n\nI will keep adding it in SIP mode.", "I've never owned it heavily, I'm owning 20 shares and it's just 0.5% of my folio, is it a good time to accumulate, like buy 3 or 4 daily for the next 30 days??", "Compare mcap and profits with reliance. CMP in line with those rations. If you expect it to  rally to 2500, it will have to almost double its profits. Even if it continues 30% growth, it will still take a min of 3 years.\n\nI think it's a  good stock to add stability to the portfolio. Helps manage downside.\nBut for returns or creating wealth, I would look elsewhere.\n\nBtw, doubled my exposure to it today.", "This turtle hasn’t moved at all in a bull market, why are people still following it?", "Bhai free mein advice deraha hu, itna sab analysis koi ache stock mein dalo. You will easily earn 20% to 30% a year in a quality mid small cap rather than wasting time in this junk.", "Akshat Srivastav ka video dekhke yaha pel Diya kya? Same points word to word bole usne", "Akshat Srivastav?? o.O", "Great summary of akshat shrivastava today's YouTube live!!🙂", "Aisi bakchodi Mera dost bhi karta tha phir use हिजड़े utha ke le Gaye.", "I sold my stake in Divis and bought HDFC yesterday. \nAgreed with your analysis.\nValuations are too juicy now.", "I think there are much better opportunities than this. It is such a slow moving stock, even though it's a solid company it probably won't give you much returns. \nI did a [video](https://youtu.be/oIO_Scjd0YI?si=SKgK3YqqemV7xe4v) on it as well. \n\nHave a look", "Just going one direction that is down down down", "🤣🤣 Nice question.", "What does that mean? Kal aur 7% girega kya? I had first bought around 10 shares of that stock at 500 when I was a dumb investor with no knowledge of stock market and no money in hand. Today, ten years later, I’m still a dumb investor with no knowledge of stock market and no money in hand, will I get a chance to buy more at 500?", "According to me there are levels around 1470, 1425, 1295. It can go to or around any of these levels.", " Bro is this your first time seeing correction? Because it does seem that a healthy correction is end of the world for you. Don’t worry hdfc will still be here and you will be asking people in no time whether you missed the boat as it keeps going up lol", "Aur bhi 2 saal sunna padh sakta hain. Lekin shayad uske agle 2 saal log bhul bhi jaye.", "And HDFC is heavily dependent on FIIs", "First person who addressed the right concern of casa deposits. 👌🏽", "It will. Historically in longer run the growth of the company reflected in Share price. You need to be patient with HDFC.", "Hold or keep adding.", "You are totally correct. But for long term investors it holds strong. It will give constant CAGR in lower or mid 10s. If someone wants to quickly make his money then they need to look elsewhere for sure. Different strategies.", "Umm, buddy CMP in line means nothing. Mcap of Reliance is 1830895 crore and mcap of hdfc bank is 10,89698 crore Reliance profit for trailing twelve months is 79104 Cr, for hdfc bank it is 60,068 crores. So if you see reliance profits is approx 1.3 times that of hdfc bank and it's mcap is approximately 1.8 times of hdfc bank. Hence, significant opportunity is present at hdfc bank.", "Cause it holds the biggest weightage in Nifty. The movement of HDFC pretty much affects the whole market.", "/Remind me after 3 years", "Check the time of my post and his video. I have not even checked he uploaded a video before you wrote this comment. Abhi jaake dekhunga.", "Hahahaha. Unke ilava bhi facts are facts.", "Posted before he uploaded I guess.", "Stock will constantly challenge 1470-1480 support level. Coming to this and going up again and again.\n\nOnce it breaks that barrier then next support is at 1420-1425 levels.\n\nThen again at 1360-1370 levels.\n\nThen again at 1285-1295 levels. This one is the strongest support. The stock will not go below this level until there is some huge scam that gets public.\n\nThe stock can reverse its downward trend from any of these levels after challenging the levels for a few times.\n\nSo do not hold all the positions at once. Buy gradually.", "You are correct but it will provide you a constant CAGR in longer run. Many a people do not understand market that well and can’t adapt to the changes and changes their strategy.", "Calm down 🤞🏻", "bhai bta to de", "You bought at 500 before a split... So by today's standards, you bought it at 250, amirite?", "bhai 1295 mai to nifty crash kar jayegaa", "Oh god can't imagine what will nifty look like then . Don't understand the reason , banks anyways dint rally much during this bull run so why such a correction", "Not my first time but sure does seem your first time by  calling it a \"healthy correction\" . HDFC Bank was never overvalued to begin with . Did you even study the fundamentals?", "Our whole market too. But HDFC has high exposure", "Don’t need to be patient with HDFc. There are tons of other stocks with good fundamentals today. Why to held on to this laggard? We take position when it rebounces after 1 year probably", "SIP add.", "Okay, it’s part of an index, got it. Why does anyone need to invest in it? Market has been going in a long bull run without its participation. Market can go without it also, let it stay in its lane.", "I will be messaging you in 3 years on [**2027-01-17 17:05:09 UTC**](http://www.wolframalpha.com/input/?i=2027-01-17%2017:05:09%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/IndianStockMarket/comments/198yotf/hdfc_bank_this_is_why_you_should_hold_or_gain/kiaxij1/?context=3)\n\n[**5 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FIndianStockMarket%2Fcomments%2F198yotf%2Fhdfc_bank_this_is_why_you_should_hold_or_gain%2Fkiaxij1%2F%5D%0A%0ARemindMe%21%202027-01-17%2017%3A05%3A09%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20198yotf)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "Your faith and determination is commendable\nI feel like doing an sip into this stock now 😄", "Bolti band ho Gayi iski 🤣🤣🤣", "Already pretty good value. \nI went all in in ITC when it went below 180. \nExact bottom fishing is a waste of time.\nI'm not a trader.", "Exactly, that's what I stated in the video. It's going to give you stable CAGR over a long enough time horizon.", "U still calm buddy? Cause hdfc is not calm at all.", ">Oh god can't imagine what will nifty look like then . Don't understand the reason , banks anyways dint rally much during this bull run so why such a correction\n\nNifty can literally correct anytime by as much as 15-20% over a short period. Possible anytime. Do not know when.", "Bcoz this result opened the real thing. There is no growth in bank. Pain is present", "Hahaha then why the hell you’re going nuts if you think the fundamentals checks out. You should be happy instead. Anyway, buzz off I gotta go buy me some more HDFC.", "Does kotak bank also have similar problems, or will it bounce back sooner ?", "Buy after it becomes expensive? \nWho is your Guru🤣", "You can. But know your goals and risk appetite.", "Hope you enjoyed the video man.", "Yes, I am calm. HDFC just has hit its support of 1365 and bounced back today. It’s a very strong support. And I have a 16000 rupees Loss on my 200 shares of HDFC. But I know it will give me returns soon.", "Pretty sure I'm not the one going nuts . But anyways sure go ahead . Atb", "For me kotak seems to be so consolidating in a box since months. One good quarter will push it out of the box on the upside. I’m waiting for that 😋", "Its fine I’m okay to miss this one stock. All the best.", "I understand\nI don't need the money anytime soon\nAm in the right path?", "\nMost people called ITC a laggard when I went all in after it went below 180.", "Yes. Then just go for it.", "And I missed that too. Booked profits early. I am fine btw. Today sold rvnl and booked profit.\nWill keep hunting stocks and booking profits regularly.\nThe curve you see in charts time to time is because of peeps like me 😂", "I missed RVNL as I was out of the market for a while! \nIt seems you're a trader. \nI don't trade..", "What percentage of stocks in nse have been multibagger? I guess its a very small number and I am not inclined to chase that."]}