{"url": "https://www.reddit.com/r/IndianStockMarket/comments/153n68n/should_i_buy_itc_stocks_now/", "post_title": "should_i_buy_itc_stocks_now", "post_content": "ITC stocks are trading at an all time high of around ~468-472. Some analysts are saying that it will grow as much as 525 in 1 or 2 months. Although after such a bullish run, there's high chances of it falling pretty hard. So what is the opinion of you guys? Do you see it rising even more?\n\nSlightly off topic, but I heard that the govt increased cigerette prices again. Yesterday I went to smoke and they charged me 18 rs for a Goldflake Lite, which was 17 just last week. So this may also affect the stock prices of the company.", "post_comments": ["Subscribe to our [weekly newsletter](https://pennyleaks.substack.com/) and join our [Discord group](https://discord.gg/8QF4dqPHuw)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianStockMarket) if you have any questions or concerns.*", "Bad time to buy now. I bought the stock when it was close to Rs 200. Its made a big run now and the price as well might increase. But from a fundamental perspective, it is not a good value at the current price.", "All aside, dude I've been paying 18 Rs since 1 year now. Which city are you in?", "If you're going to hold it for next 5-6 years then whenever you buy this types of stocks it's doesn't matter. Because itc type blue chip stocks are evergreen+ trusted company", "BUT WITHOUT A DOUBT.\nAs long as you don't see people quitting cigs in mass, BUY IT! I just started a SIP for ITC to buy 2 shares per week.", "https://preview.redd.it/7p2n7n5qowcb1.jpeg?width=1080&format=pjpg&auto=webp&s=6d96620353aabc3e735f69e0320fa3f9b670b012", "U can buy but u won't get THAT PROFIT so quickly....i entered at 200 and exited all at 415...I'm happy with this...\n\nBut when u enter at 450 and expect it to go 700,800 ...that won't be happening....it's like a stock u can enter and exit anytime u want....", "The stock is trending, buy pullbacks, if u don't know how to do that, just buy on red candles,i mean buy around 3-3:30 pm if the stock is down for the day. Buy small quantities on red candles.", "If your buying makes my bought heftier then sure, why not. Not like it has peaked or anything. BUY IT FOR YOUR OWN GOOD AND NOT BECAUSE YOUR BUYING MAKES ME , well nothing🤭", "Itc is a stock that historically very stable and do very less price moment …. I am bullish on its business and think it can go to 1500 in nxt 2-3 yrs", "Hume kya hum toh Marlboro peete hai aur loss book krte hai !!🤡", "If those analysts surely know it’s going to 525 in 2months why don’t they sell their houses and just put everything in ITC and later end up being financially free their entire life? Well no one knows anything. You need to do your own research and you need to do what your mind says about the company’s future", "ITC TO THE MOON, all jokes aside, I'm buying and telling everyone around me who's into stocks to buy", "Based on the market capital and comparing to other companies above it. It can go up 40% .", "Please wait for the index to drop by a 100 points", "ITC is one of the largest and most diversified companies in India, with businesses in FMCG, hotels, paper, agri, and IT. It has a strong brand portfolio, distribution network, and cash flow generation. However, it also faces challenges such as high taxation on cigarettes, slow growth in non-cigarette segments, and regulatory uncertainties.\n\n&#x200B;\n\nAccording to the search results, ITC stocks are trading at an all-time high of around ₹468-472, with a P/E ratio of 30.66. Some analysts are bullish on the stock and expect it to reach ₹525 in one or two months, while others are bearish and expect it to fall to ₹400-410 levels. The stock has given a return of 60.82% in the last one year and 42.63% year-to-date.\n\n&#x200B;\n\nThe recent increase in cigarette prices by the government may have a positive or negative impact on the stock price of ITC. On one hand, it may boost the revenue and margins of the company, as it has a dominant market share and pricing power in the cigarette segment. On the other hand, it may also affect the volume and demand of cigarettes, as consumers may switch to cheaper alternatives or quit smoking altogether.\n\n&#x200B;\n\nTherefore, if you want to buy ITC stocks now, you should do your own research and analysis and follow your trading plan. You should also consider the fundamentals, technicals, and valuations of the company and the industry. You should also be prepared for the volatility and risk involved in the stock market. #ITC #Stocks #Trading", "Buy during dips", "When I first started 10 years ago, Goldflake lights was Rs 6, chota Goldflake was Rs 5. Price has tripled in 10 years (comes to approx 11% annual rise, higher than inflation). \n\nI no longer smoke so I can't say anything about consumer sentiment but these prices still sound affordable. Only the middle class buy cigarettes, the poor have bidis. In some western countries they have raised the cigarette prices to absurd levels and that has resulted in many people quitting or reducing the amount of cigarettes they smoke. Maybe we will reach such a point in a few years and hopefully ITC will have better diversified by then.", "Overhyped nonsense lmao y'all didn't buy at 300 why now", "Cigarettes and alcohol are tax getters for the government, it’s true that overall the consumption of alcohol and cigarettes are increasing with the hectic lifestyle- so I don’t think demand is going to be a problem anytime on the future.  It since these are like ‘sin’ commodities, these would never get tax reductions and only going to get more taxed in the future, so no longer look at ITC from that point of view - the company is going to divest more from here , but every other sector of FMCG already has tough competition. So look at it as an FMCG STOCK..", "I started gold flake at Rs.3.50 and kings was then Rs.4 and Wills was Rs.5", "It's reached 19 and some places 20 in gurgaon lmao", "Kolkata bro. I thought cigerette prices were supposed to increase from next financial year.", "And smoke atleast 2 cigarettes per day.\nGrowth bhi to laani hai.", "Cigarette biz is highly regulated by government. You can’t be so sure about this stock", "Researching on this too", "I don't understand this. You mean to say at 3-3:30 pm I'll get the stock at lowest price on that day?", "1500 damnn. May I know on what basis are you predicting such?", "Why?", "Bhai ChatGPT se answer copy paste kiya kya?", "Bro what era was that?", "Bingo FTW!", "If it's a red candle that day, then almost yes. My logic is a stock that is trending or its in a Stage 2.\n\nBuy pullbacks if u can, but if u don't know how to do that, simply keep buying the red candles. And do that around end of the day.", "See the returns in last 3 months the market are going 70k till diwali i think", "If more ppl buy, price will increase right? Simple…", "If you ask Bard.. \"Yes, the text you provided is written by AI. It is a factual and objective summary of the company ITC, its business, and its stock price. The text does not express any opinions or beliefs, and it does not make any recommendations. It simply provides information that a potential investor might find useful.\"", "2007. Price really picked during BJP times", "Wtf", "I meant why is he buying himself?", "i ment sensex not nifty"]}