{"url": "https://www.reddit.com/r/IndianStreetBets/comments/11hypum/will_itc_ever_see_a_downfall_from_here/", "post_title": "will_itc_ever_see_a_downfall_from_here", "post_content": "[deleted]", "post_comments": ["Number one rule of Wall Street. Nobody... and I don't care if you're Warren Buffet or if you're Jimmy Buffet. Nobody knows if a stock is gonna go up, down, sideways or in fucking circles. Least of all, stockbrokers, right?", "[deleted]", "Log pehle mazak udaate the ITC ka kehte the 200 ke note ki jagah ITC ka stock chalega bazar m.aaj kl ese posts aane lage h", "Invest in ETFs", "Its all market cycle. Market favors \"Value\" stocks when interest rate cycle is on upswing, when reverse happens and interest rates starts falling it will be the turn of growth stocks to see the sunshine.", "[deleted]", "In a normal day ITC either go up or doesn't move at all. Going down is an exception.", "If you cannot do your own research, I would suggest you put that money into an Index ETF and not ask people on social media forums what to do with it.\n\nMoreover ITC was a value stock at 200, now I can't say whether it will go up or down, it sure as hell is not as safe of a bet for fresh capital allocation it used to be back when it wasn't moving much.\n\nDisclaimer - I am not a registered financial advisor and am holding ITC at an average of below 200 for a considerable amount of time now.", "Itc is a good company, it may correct by 10-20% in long term. But overall a good company for long-term...", "Bruh, do some fundamental research. ITC is a good company, but don't put all money together, put little little every month when stock price falls a bit. Also ITC gives regular dividends. Also for long term, have 5 good company stocks, and har month thoda thoda dalneka\n\nIf you do not have much time for tracking the stocks and stuff, buy MF.", "It will revisit 200 again in next 5 years.", "Invest in Reliance it’s most diversified stock", "Hi, /u/Zlibraries! Welcome to /r/IndianStreetBets!\n\nUse the Daily Discussion Thread for basic queries. Before contributing, do check if your particular question has been answered in the [Wiki](https://www.reddit.com/r/IndianStreetBets/wiki/index). Do utilise the search function to do the same too. Please use proper [post flairs](https://www.reddit.com/r/IndianStreetBets/wiki/index/postflair) and adhere to the rules in the sidebar. You are urged to post beginner questions in the stickied daily discussion thread or on our [Discord in \\#beginner-questions channel](https://discord.gg/SeDa9Fhwqv) so as to keep the subreddit as clutter-free as possible. **If this post has good insights or well research, tag the Mods so we can give a shoutout on Discord and get the post more traction** Thank you! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianStreetBets) if you have any questions or concerns.*", "All momentum will build up if further quater results are good. Few months before budget, it will start struggling :)", "Just a quick question, do itc give any kind of care packages to their investors?", "Few stocks must be accumulated for dividends. ITC is one of them.", "What is your time frame for the investment? If it is really long term then don't think just invest it and forget it. If it is short term look else where", "For how much investment you got 25k bonus? Can you please tell me the amount?", "By the end of this year it will reach 450-500. However invest where you think is right. Maybe another TERM Plan ?", "the upvote/downvote buttons of this sub should be swapped", "There's a good chance of it going up or going down or staying still in the future. All three results are possible.", "It has doubled in last 2 years - there is no guarantee that it will do the same in the next 2 years\n\nDo your research first to build conviction", "Every stock goes down at some point. Some free fall and others go down at certain point only to move back up.", "It's a fugazi", "Over the long term, you can still have a decent enough idea where the stock would go. Over the timespan of a day to say 3 years, it can go either way.", "You're wrong.", "Modi knows", "This is the information we can't find in any newspaper or any where else. This is the kind of info for which i follow this sub !!", "Noice. On point", "🤣", "I didn’t think of that.", "Big if true", "How turns table", "ETF stands for Enterprises, Total gas and Family Funds?", "Thanks a lot! 👑", "How to keep stop loss for investments?", "I don't have much time, my portfolio management us already good as my investments were done in 2020 in the first 4 months, wanted to build a separate portfolio for my nephew where I don't have to keep a keen eye on what's happening.", "Or it could become 2000", "I already have done it with the Diwali bonus when Russian war started.", "What is care packages", "15 years, kid is 3. Hoping to find his education by the time he turns 18.", "This is company bonus, I've been investing in safe stocks with the bonuses for my nephew so that he can use it for his education when he grows up. Have NIFTYBEES, Reliance, Infosys.\n\nMy portfolio is worth 69L invested 17L during Covid. Withdrew some to loan a house. Need around 25L lumpsum to payoff the home loan.", "Also known as fairy dust", "True, but that long term could be 5, 10, 25, or even 50 years.", "Its a famous dialogue from a movie \"The Wolf of Wall Street\"", "Turns how table", "Bro tells barber he doesn’t like his cut", "If you don't have much time to be active in stock market and would still like to invest, I would suggest invest in index funds or ETf - Nifty bees/gold bees and such. Good investment, low chance of loss.", "Find his education next year man. 18 is too old for KG.", "What platform do you use to invest in what you've mentioned above?", "Tables turn how", "Already have invested in NIFTYBEES, Reliance and Infosys for long term.\n\nI don't get time to keep a tab on that portfolio as I'm busy on mine all day.", "Started with GROWW and Coin & Kite Zerodha", "Turn table how..", "And now you've shifted to something else?", "Who turns the table?", "How table turns", "Still using all 3", "Why table turns?"]}