{"url": "https://www.reddit.com/r/IndianStockMarket/comments/18v33bz/itc_2024_thoughts/", "post_title": "itc_2024_thoughts", "post_content": "Hello guys, I have some ITC stocks at 430 range. What you guys think will it rise at 2024? I know I'm too late at the party. I want to hold for long but if it doesn't rise much there is no point of holding for longer term. Some analyst saying it will rise to 500 mark, is it really gonna happen, what you guys think?", "post_comments": ["\nIf you haven't already, please add your own analysis/opinions to your post to save it from being removed for being a Low Effort post.\n\nPlease DO NOT ask for BUY/SELL advice without sharing your own opinions with reasons first. Such posts will be removed.\n\nPlease also refer to the [FAQ](https://www.reddit.com/r/IndianStockMarket/comments/17bcg2a/frequently asked questions_post_your_common/) where most common questions have already been answered.  \n\nSubscribe to our [weekly newsletter](https://pennyleaks.substack.com/) and join our [Discord group](https://discord.gg/8QF4dqPHuw)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianStockMarket) if you have any questions or concerns.*", "I'd assume 15% for the year plus the demerger of ITC hotels should help free up cash flows for 2025 and improve its roe and roce propelling up ITC for 2025 with my personal target of 600. I also look forward to it's dividend increasing to 15 rupees this year and 18 next year.", "Bhai phele decide krle kya krna h. In one sentence you say \"long term\", in another you say \"too late to the party\". How can be you late if you are looking for long term? Ek din me 1000% tordhi na milta h. Phele apna thesis clear rakho phir company dekho.\n\nAb mera gyan- ITC is a slow moving giant, with a very stable and in house name brands. Free cash flow bhayankar banati h due to cig and they use that money to venture into new businesses. Some stick some don't. Now from a share point of you- It essentially double every 6 year, which means a CAGR of around 14% with a healthy amount of yearly dividends. I believe in the FMCG brands that they are building (ashirvad, sunfeast) so I am comfortable with holding them for the next 7-10 year's if nothing drastically changes. Plus there is always the nicotine addiction which has proven resilient against all the government bans so that instills more faith for me.", "It will probably touch 500 this month only. But that's just my guess.", "Why not hold till November?", "Itc to the moon.....", "Slow growth but if you’re holding for long term it’s ok. It will definitely go up but growth is slow that’s the only problem. I’m also in the long term game and hold itc at 440. They have good dividends and I don’t mind the slow growth.", "Average down and increase your holding coz I am sure that the new year will start with a gap down opening. Profit booking is done till Mar 24. :)", "ITC will go, they have multiple businesses in consumer products again they are the player provider of tabcoo products. Legal and addicted businesses never lose customer", "ITC is not a good stock . because it is a large cap stock and can't multiply 10x in next 10 years .", "540", "Just hold if already bought", "ITC to moon", "No worries, celebrate highs and lows both … add more on dips and book a portion on highs ..", "Mera avg 450, looking for crash, expected LTP between 250  to 350", "My purchase price is 473 and I have suffered huge losses as I have taken futures. Already at a huge loss", "You're giving me some hope. I would love to add some more.", "With the recent fall, do you still see its gonna give good returns as you expected?", "I started investing from April 12. 2nd Jan ITC price 327 I bought ITC at 430 so I am late at the party.\nThank you very much for your Gyan it means a lot for beginner like me.", "It goes to 490 mark this year and then ITC hotel thing happened. Let see thank you.", "W guess, you were right", "Why November, why not December?", "Remindme! after 1 year", "Okay thank you I will.", "Y😂😂", "Do you think if correction happens itc price will fall down to 250 to 350?", "ITC will fall after demerger of hotel business.", "Do you still hold onto your words that it will crash around this region?", "I hope it comes true. My purchase price is 200 levels and I'm not adding anymore. But riding the wave...", "500 is a 25% return and a further 20% for 600. I may have to correct my number expectations to maybe 475 and 550. However my dividend expectations are the same given that this financial year they have already announced and paid INR 13 per share. 15 in 2024-25 and 17-18 in 2025-26 is very much doable for dividend payouts.", "Can you please explain the 'Hotel Thing'?", "Lol. That's the thing about guesses. I was flat out wrong.", "Demerger", "I will be messaging you in 1 year on [**2024-12-31 10:04:28 UTC**](http://www.wolframalpha.com/input/?i=2024-12-31%2010:04:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/IndianStockMarket/comments/18v33bz/itc_2024_thoughts/kfokacm/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FIndianStockMarket%2Fcomments%2F18v33bz%2Fitc_2024_thoughts%2Fkfokacm%2F%5D%0A%0ARemindMe%21%202024-12-31%2010%3A04%3A28%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2018v33bz)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "Bro it is a large cap stock which can't go 10x in 10 years .", "100 percent bro", "You are in win win situation.", "I am expecting that it would fall around 360-375 region. Would you think the same, just want to know your views. Thanks!", "Demerger of hotel business.", "For every ITC share you will get an ITC hotels share after demerger.", "ikr, represents how hard it is to interpret stuff", "Demerger happening in November?", "Ok. I think you are a trader.. Not an investor.. Sorry to pitch in", "My dividend yield is already 6% wrt purchase price. Looking forward to improving yields yoy. Eventually in the next 7 -8 years, my purchase price becomes free due to dividend recieved.", "*For every 10 ITC share, you will get 1 ITC Hotels share after demerger.", "Oh, ig I saw it somewhere where One ITC hotel Share:10 ITC shares, so like 10:1 ratio.", "Yes, back in August they said 15 months. So should be around November 2024", "Not a trader not a investor just a money maker by using loophole.", "I would definitely add some more and wait.", "😂😂Say this during a market correction if happens", "Yes and enjoy the sweet dividends", "By the way I haven't seen a rich investor investing in large caps .", "I'm planning to enter this week, and plan to hold for 2-3 years, what's the reason around selling before demerger?", "Because he became rich after investing in large caps.. And he can be able to take risk.. Unlike others who just want to make profit without understanding the business of a company", "Im not selling before demerger, I'm holding for another 5 years. I'm just saying might as well hold till demerger and get ITC hotel shares.", "Just give me one example.", "Kyu bolti band hogai ?", "I can explain the business which I have ."]}