{"url": "https://www.reddit.com/r/HCMC/comments/13cr23z/even_google_search_has_hcmc_up_500_by_2024_lfg/", "post_title": "even_google_search_has_hcmc_up_500_by_2024_lfg", "post_content": "", "post_comments": ["Am I rich yet?", "Still a long road ahead. #retirementmoney", "I'm holding until this plays out", "Ahhh", "Where do you buy", "500%?🧐\nIts up 9,900% today, and the profit still cant buy me a bottle of ketchup.", "We just have to be patient is all 💰", "When they do the 5m buyback they said they would before end of year it should be around that. Please note we are not talking a huge price.", "[removed]", "I've spent 2k! so, if that works out I'll be one happy chappy!", "But i’m 8x down", "How is this stock not worth anything when all the businesses are doing well? Because they're too many shares?", "500%!!! Oh good! I’ll still about $4k-$5k ⬇️ but that’s atleast progress 💪", "Up 500%would leave me down 50%. Hoo-fucking-ray.", "Y’all this play is dead & buried…really need to move on", "Absolutely,, but know the market maker wants your shares to cover all the synthetics they're using to manipulate HCMC price 20x a day.", "Think about how much effort these shills are putting into these reddits to convince you HCMC is trash and you should sell(at all time low too, lol) ,, it's really a no brainier,, can't lose any more for those that are down,, and for those that got it at 0001,, it can only go up with all the positive catalysts happening! I'm both,, I bought at the peak and also doubled down at 0001.", "I use fidelity!", "That's shitadel the market makers game. Not hcmc. There's a dozen zombie stock's they have algos manipulating.", "Wtf.  It went up and down 10,000% ten times today.   That’s fkn nuts ?", "💯", "I don't know the date, I've never heard a date.. I thought it was starting a few weeks ago when HCMC volume numbers jumped back up.. surely 50billion shares being bought(1\\6 of the float=$5mil@0001)would be noticable in the level 2!!\n There also 2 other catalysts like p\\morris case and HCWC dividend,, both of which can also push HCMC price up!!\n I'm hopeful HCMC is going to move up dramatically this year! Google HCMC price predictions,, you may be very surprised what you find!!", "Hopefully that's not the case and we all will be 💰💰", "Did you average down while it's at 0001??? Google it if you don't know what that is.", "The price is being illegally manipulated by the market maker. Google zombie stocks. It no reflection of the company.. theres dozens company's wall street algorithms are doing this to for the last year!", "Maybe you prefer a negative article??? Funny it's up %10,000 today... Soo according to your math,another 500% up leaves you down 50%,  so you hold zero ?? Have You ever even commented on HCMC b4?", "Big financial advise from a  1 karma post shill! Why do you need HCMC investors to sell at the all time low?? The only real move is to hold and wait this criminal market marker out!! 🤣🤣🤣", "Google zombie stocks , it's illegal price manipulation by the market maker. It's insane that there's 20 stocks they've done this to for the last year while regulators get paid to look the other way!  ask your self who's selling at 000001 and where's the selling volume coming from to allow this criminal market maker shitadel to buy at 000001 20x a Day ?? They just create fake synthetics and then bash the stock as much as they can hoping you'll sell so they can cover their synthetics. If you do not sell they have to buy your shares back eventually. I'll hold my shares and wait because I know what they're doing and how they're doing it.", "They said by end of year.", "My first bought was at 0012 after that i brought to 0,0045", "Gotcha well that stinks.", "I don’t see how it can be up 10000% when it’s still at.0001. It’s called math. Uo 500% from .0001 is .0005. .0005 is 50% of .0010 which could conceivably be where my 1,000,000 shares were purchased. But you can go ahead and scoff in your ignorance all you want. Let’s get to .0003 and hold it for a day or two.", "Hey you’re either a shill for this company or a straight up retard, either way go broke for all I care.", "When I looked it up today 🤯\n\nEdit.   It is absolutely insane they get away w/ this.", "Thx for the info,, maybe that's why Google search has multiple sources with price target 400-500% for HCMC by end of year.\nThat would also explain All of the sudden interest by the shills trying to bash HCMC, their short positions or their market makers pump and dump scam is in jeopardy if HCMC moves up in price dramatically!", "HCMC is a long-term investment for me, I bought all the way up and all the way down and double down at 0001 and picked up about 60 million more. I don't even know my avg, probably 0003 or 0004 if I had to guess. Waiting for $1", "Yes,, if your in a hurry, and easily distracted by the shills in here! But if you patient The extremely depressed prices creat6amazing buying opportunities. Look at many of the itc stocks and see the 1 yr chart! Many down 90%. Solid company's , like HCMC, still growing and expanding will return to normal valuations eventually,, and that's the bargain waiting these corrupt shf out.", "That's the illegal part , the market maker/hedge fund (shitadel) trades at . 000001. Yahoo finance pos6t 9900% from 000001 -0001 many times per day!! ive called fidelity several times and TD,, same answer that's no brokers or retail can trade at 6 decimals!!! Only shf!!", "I quick look at your post history tells it all, your either bashing AMC or HCMC.. didn't take a retard to figure out your game 🤡🤡", "I agree 100%,, they will get away with it till the can't anymore,, that days going to come. Dont know when or how,, but I'll make sure I'm holding 10mil plus of each one of the dozens of these OTC stocks that are artificially manipulated (like HCMC),they are down 2000%-20,000% from their regular price history!!!", "You can forget the .$1", "[removed]", "The guy that's down 80% suddenly feels he can predict the future??", "I'm only referencing facts.. Sorry to disappoint , but I've been comfortably retired for 24yrs.  And a wise man once said,*only invest what you can afford to lose\" I practice that and sleep well, but also am very confident with my investments because of solid DD and research. Which is why I can refute low level shill🤡🤡 that spend 5min of research b4 post ridiculous negative fud, like your history clearly shows. And your 1 karma post shill rating acknowledged 🤣🤣🤣", "The guy that believes it can go up til 1 dollar also believes in Fairytales 😂", "[removed]", "On the positive side to support a $1 s\\p, HCMC is doing a $5mil, 1\\6 float buy back, issung a hcwc dividend with very low float to be Nasdaq listed, and continues to increase revenue each quarter while expanding and making acquisitions, and the p\\morris lawsuit is back in the table,, any and all of those specifics can dramatically effect HCMC price in a positive manner. Inversely, what do you have to support your conclusion of \"only in a fairy tale\"??", "So if you've \"invested wisely\" according to you,,why are you here since you said HCMC is garbage !! If you don't own HCMC and it's a bad investment, why are you in a HCMC sub telling people, that do actually own HCMC shares,  they made a bad choice??? Typical shill response is always a personal attack when they've exhausted their limited knowledge of the stock! Hopefully to promote hate and misery in the sub so people don't share any positive sentiments or DD.. Don't be mad bro.", "Keep on dreaming my friend 😂"]}